[
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-Machine-Learning-Engineer-Karlsruhe-Koeln-Muenchen-Hamburg-Stuttgart-Pforzheim-Berlin-Erlangen-inovex-GmbH--11713465-inline.html?rltr=1_1_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Im Team Data Management & Analytics helfen wir unseren Kunden dabei, ihre Daten nutzbar zu machen und große Datenmengen zu automatisieren. Der Fokus liegt bei uns darauf, skalierbare Architekturen zu schaffen, die das Fundament für spätere Analysen und data-driven Services bilden.",
            "*Wir bei inovex mögen Vielfalt und Individualität. Deshalb freuen wir uns, wenn du unser Team noch bunter machst.",
            "Gemeinsam mit deinem agilen, cross-funktionalen Projektteam hilfst du unseren Kunden aus unterschiedlichen Branchen, ihre Daten nutzbar zu machen.",
            "Als Data Engineer* / Machine Learning Engineer* gestaltest du das Fundament für spätere Analysen sowie data-driven Services und entwickelst skalierbare, robuste und wartbare Architekturen.",
            "Du konzipierst und implementierst Datenplattformen, Datenverarbeitungsprozesse und Daten-Services als hochskalierbare, verteilte Systeme in der Cloud, on premises oder hybrid.",
            "Relationale und NoSQL-Datenbanken",
            "FastAPI, Flask",
            "Databricks, Spark, Kafka, Airflow, dbt, BigQuery oder Snowflake",
            "AWS, GCP, Azure",
            "Docker, Kubernetes",
            "Du konntest mindestens zwei Jahre Praxiserfahrung sammeln und bringst erweiterte Kenntnisse in mehreren der oben genannten Technologien mit.",
            "In der schnelllebigen Data & AI Tooling-Landschaft behältst du den Überblick. Du begeisterst dich dafür, neueste ML-Lösungen lauffähig in den Praxisbetrieb unserer Kunden zu implementieren und scheust nicht davor, Aufgaben in Infrastruktur, Backend oder Frontend zu übernehmen.",
            "Du kannst gut priorisieren und hast ein Gespür für die richtige Balance zwischen Pragmatismus und Perfektionismus.",
            "Sehr gute Deutschkenntnisse sind Voraussetzung (mind. Level C1), gute Englischkenntnisse runden dein Profil ab."
        ],
        "lists": {
            "company": [
                [
                    "inovex GmbH",
                    "Karlsruhe, Köln, München, Hamburg, Stuttgart, Pforzheim, Berlin, Erlangen",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Gemeinsam mit deinem agilen, cross-funktionalen Projektteam hilfst du unseren Kunden aus unterschiedlichen Branchen, ihre Daten nutzbar zu machen.",
                    "Als Data Engineer* / Machine Learning Engineer* gestaltest du das Fundament für spätere Analysen sowie data-driven Services und entwickelst skalierbare, robuste und wartbare Architekturen.",
                    "Du konzipierst und implementierst Datenplattformen, Datenverarbeitungsprozesse und Daten-Services als hochskalierbare, verteilte Systeme in der Cloud, on premises oder hybrid."
                ],
                [
                    "Python, SQL, Java",
                    "Relationale und NoSQL-Datenbanken",
                    "FastAPI, Flask",
                    "Databricks, Spark, Kafka, Airflow, dbt, BigQuery oder Snowflake",
                    "AWS, GCP, Azure",
                    "Docker, Kubernetes"
                ],
                [
                    "Du konntest mindestens zwei Jahre Praxiserfahrung sammeln und bringst erweiterte Kenntnisse in mehreren der oben genannten Technologien mit.",
                    "In der schnelllebigen Data & AI Tooling-Landschaft behältst du den Überblick. Du begeisterst dich dafür, neueste ML-Lösungen lauffähig in den Praxisbetrieb unserer Kunden zu implementieren und scheust nicht davor, Aufgaben in Infrastruktur, Backend oder Frontend zu übernehmen.",
                    "Du kannst gut priorisieren und hast ein Gespür für die richtige Balance zwischen Pragmatismus und Perfektionismus.",
                    "Sehr gute Deutschkenntnisse sind Voraussetzung (mind. Level C1), gute Englischkenntnisse runden dein Profil ab."
                ],
                [
                    "Kommunikation auf Augenhöhe, flache Hierarchien, Arbeiten in selbstorganisierten und agilen Teams, Vertrauen und Offenheit, starker Zusammenhalt",
                    "Weiterbildungsbudget, eigene inovex Academy, Onboarding- und Mentoring-Programm, enger Austausch mit der Community",
                    "Flexibles und mobiles Arbeiten, keine Kernarbeitszeiten, Workation, 30 Tage Urlaub",
                    "Flexibles Arbeitszeitmodell, Zuschuss zur Kinderbetreuung, Überstunden nur im Ausnahmefall",
                    "Betriebliche Altersvorsorge, E-Gym Wellpass, inovex Sportgruppen / Sport-Community",
                    "JobRad, Firmenwagen-Leasing"
                ]
            ],
            "unnamed_list": [
                [
                    "Expert jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Glasfaser jobs",
                    "Tax Specialist jobs",
                    "Steuerreferent jobs",
                    "Digital Sales Manager jobs",
                    "Buchhalter/In Debitoren / Kreditoren jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Business-Data-Analyst-Engineer-m-w-d-Voll-oder-Teilzeit-Koeln-ROLAND-Rechtsschutz-Versicherungs-AG--11903071-inline.html?rltr=2_2_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Wie wir es schaffen, nicht stillzustehen? Wir sind ein starkes Team aus Nachvorneschauern*, Cleverdenkern, Innovationstreibern und Visionenverwirklichern – so gestalten wir gemeinsam die Gegenwart und die Zukunft.",
            "Werde Teil des Teams!",
            "Interesse geweckt? Sehr gut! Deine Bewerbungsunterlagen kannst Du ganz einfach über den Button „Jetzt bewerben“ hochladen.",
            "* Nachvorneschauer und alle weiteren Beschreibungen umfassen alle Geschlechter und werden von uns im Plural beschrieben."
        ],
        "lists": {
            "company": [
                [
                    "ROLAND Rechtsschutz-Versicherungs-AG",
                    "Köln",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Zusammen mit unseren Data Scientisten und Data Analysten aus den Fachbereichen realisierst du ganzheitliche Datenlösungen zur Anbindung und Verarbeitung unterschiedlicher Datenquellen in AWS, Snowflake und Tableau",
                    "Konkret entwickelst du moderne ETL/ELT-Strecken im Toolstack AWS, Snowflake- Datawarehouse (DWH) und Data Build Tool (DBT)",
                    "Du gestaltest aktiv das Datenmanagement durch Beratung der internen Fachabteilungen bei der Konzeption und Definition der Anforderungen",
                    "Mit dem Team entwickelst Du gemeinsam unsere cloudbasierte Analytics-Plattform weiter und optimierst die Datenintegration und -aufbereitung",
                    "Auf Basis der entwickelten Datenlandschaft unterstützt Du bei der Entwicklung und Erstellung von Dashboards und Auswertungen"
                ],
                [
                    "Du bringst ein erfolgreich abgeschlossenes Studium der Wirtschaftsinformatik oder ein betriebswirtschaftliches Studium mit und hast ggf. erste Erfahrungen in der Versicherungsbranche gemacht",
                    "Mehrjährige einschlägige Berufserfahrung im Datenumfeld und Erfahrungen mit Cloud-Lösungen wie AWS / Snowflake zeichnen dich aus",
                    "Du hast Erfahrungen in der Modellierung analytischer Datenmodelle von der Integrationsschicht bis in die fachlichen Informationsmarts.",
                    "Wünschenswert wären zudem Erfahrungen mit mindestens einer der genannten Modellierungstechniken. 3NF, Data Vault, Star-Schema oder Snowflake-Schema",
                    "Zudem besitzt du Erfahrungen in der Optimierung der Performance von Tableau-Datenquellen im Zusammenspiel mit unserem Snowflake-DWH",
                    "Du besitzt gute analytische und konzeptionelle Fähigkeiten, eine ausgeprägte Teamfähigkeit, eine selbständige wie auch zielorientierte Arbeitsweise und hast Lust auf agile Arbeitsweisen",
                    "Die Begeisterung für neue Technologien und die Fähigkeit, komplexe Sachverhalte einfach darzustellen bringst du ebenfalls mit",
                    "Du besitzt sichere Deutsch- und Englischkenntnisse"
                ],
                [
                    "Wer sorglos nach vorne schauen will, muss bereits heute für morgen abgesichert sein. Wir bieten Dir Bausteine zur betrieblichen Altersvorsorge sowie Rabatte bei Versicherungsprodukten.",
                    "Damit Dir die Work-Life-Balance gut gelingen kann, unterstützen wir Dich mit flexiblen Teilzeitmodellen, Gleitzeit sowie mobilem Arbeiten. Zudem bieten wir ein bezuschusstes Jobticket sowie eine eigene Mitarbeitenden-Kantine.",
                    "Unser Weiterbildungsangebot wächst stetig, damit sich unsere Nachvorneschauer fachlich und persönlich entwickeln können. Zusätzlich fördern wir die interne Vernetzung unserer Mitarbeitenden durch zahlreiche Formate.",
                    "Bei uns hast Du die Möglichkeit, die Zukunft der Versicherungsbranche aktiv mitzugestalten. Es erwartet Dich eine offene und unterstützende Arbeitsatmosphäre mit einem vielfältigen und spannenden Aufgabenspektrum.",
                    "Die ROLAND Werte sind ein fester Teil unserer Unternehmenskultur. Sie gestalten unser Miteinander, dienen uns als Wegweiser für Entscheidungen und ermöglichen uns, mutig neue Wege zu gehen."
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Datawarehouse-Oldenburg-CEWE-Stiftung-Co-KGaA--11922994-inline.html?rltr=3_3_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Man nehme die Leidenschaft, anderen Freude zu bereiten, und multipliziere es mit mehreren Tausend kreativen und engagierten Köpfen. Heraus kommt das Erfolgsprinzip von Europas führendem Fotoservice und Markenhersteller im Fotofinishing. Wir bei CEWE kreieren, produzieren und vertreiben ebenso einzigartige, wie persönliche Fotoprodukte. So bringen wir von unseren Standorten aus Menschen in ganz Europa zum Lächeln. Wir freuen uns dabei auf Ihre Unterstützung!",
            "Als Data Engineer sind Sie Teil unseres zentralen Data Management Teams innerhalb der Business IT. Sie konzeptionieren und entwickeln zentrale Datenmodelle für unser europaweit eingesetztes Enterprise Datawarehouse.",
            "Auf Sie warten spannende Aufgaben, tolle Produkte, ein großer Gestaltungsspielraum für Ihre Ideen, eine freundliche, sehr kollegiale Arbeitsatmosphäre und ein bemerkenswerter Teamgeist!"
        ],
        "lists": {
            "company": [
                [
                    "CEWE Stiftung & Co. KGaA",
                    "Oldenburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Sie gestalten die Architektur, Datenmodelle und Prozesse unseres Enterprise Datawarehouses (ORACLE) mit",
                    "Sie unterstützen das BI- und Analytik-Team mit In-Memory-Technologie (EXASOL)",
                    "Den Support der Datenqualität für die unterschiedlichsten Fachbereiche unterstützen Sie über das Business IT Service Desk (JIRA)"
                ],
                [
                    "Ein erfolgreich abgeschlossenes Studium der Informatik, der Wirtschaftsinformatik, Wirtschaftsingenieurwesen oder eine vergleichbare Ausbildung bildet die Grundlage Ihrer Qualifikation",
                    "Sie verfügen über SQL -Erfahrungen",
                    "Sie interessieren sich für Big Data Lösungen und bringen Grundlagenkenntnisse in Datenmodellierungs-Techniken und ETL-Werkzeugen mit",
                    "Sie sind ein echter Teamplayer, der es versteht, in einem harmonischen Teamumfeld zu agieren und zum Erfolg beizutragen",
                    "Gute Deutsch-Kenntnisse (mindestens C1) in Wort und Schrift runden Ihr Profil ab"
                ],
                [
                    "Die Möglichkeit einen Teil Ihrer wöchentlichen Arbeit aus dem mobilen Arbeiten / Home Office heraus zu erledigen",
                    "Vielfältige Weiterbildungsmöglichkeiten, u.a. aus einem breit gefächerten Angebot von eigenen Seminaren und Trainings",
                    "30 Urlaubstage und eine tarifliche Wochenarbeitszeit",
                    "Ein Mitarbeitendenaktienprogramm sowie eine durch CEWE geförderte betriebliche Altersvorsorge",
                    "Unterstützung bei der Kinderbetreuung in unserer betrieblichen Großtagespflege „cewelino“ in Oldenburg",
                    "Weitere umfangreiche soziale Leistungen (z.B. Sonderurlaubstage, jährlicher Gutschein für den CEWE Bekleidungsshop, Kinderferienbetreuung und viele mehr)",
                    "Umfassende Angebote der betrieblichen Gesundheitsförderung (z.B. Fahrradleasing, Gesundheitskurse, Psychosoziale Beratung, Hansefit)",
                    "Eine tolle Stadt, in der CEWE zuhause ist und in der es sich sehr gut leben und arbeiten lässt."
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-SAP-BW-m-w-d-Berlin-Gewobag-Wohnungsbau-Aktiengesellschaft-Berlin--11770965-inline.html?rltr=4_4_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Wir suchen zum nächstmöglichen Zeitpunkt in unserer Abteilung IT (Informationstechnologie) für unser Team Datenmanagement einen",
            "Data Engineer SAP Business Warehouse (w/m/d)",
            "Die Stelle ist unbefristet in Vollzeit/Teilzeit zu besetzen."
        ],
        "lists": {
            "company": [
                [
                    "Gewobag Wohnungsbau-Aktiengesellschaft Berlin",
                    "Berlin",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du entwickelst und optimierst Berichtsstrukturen im SAP BW/4HANA, erstellst Queries und HANA Calculation Views und integrierst diese in analytische Anwendungen wie Microsoft Power BI. Zudem erstellst du auf Anfrage von verschiedenen Fachbereichen Berichte in SAP Analysis for Office.",
                    "Du stellst die Datenqualität und Durchführung von Fehleranalysen und -behebungen bei auftretenden Systemproblemen sicher.",
                    "Du stimmst dich eng mit dem Team Datenmanagement und den KollegInnen aus der IT ab, um die Anforderungen nachhaltig und bedarfsgerecht, sowohl technisch als auch organisatorisch, umzusetzen.",
                    "Du wirkst bei SAP BW/4HANA-Projekten mit, von der Anforderungsanalyse bis zur Implementierung. Du unterstützt bei der Konzeption und Entwicklung von Datenmodellen und Datenflüssen in SAP BW/4HANA sowie bei der Einführung und Weiterentwicklung von übergreifenden Datenmanagement-Initiativen, wie z. B. einem Datenkatalog."
                ],
                [
                    "Qualifizierte IT-Ausbildung oder vergleichbare Berufserfahrung (Bewerbungen von Junioren sind ebenfalls erwünscht)",
                    "Erfahrung im Query Design und der Erstellung von HANA Calculation Views im SAP BW (idealerweise unter SAP BW/4HANA) sowie mit dem HANA Studio; Kenntnisse in SQL / SQLScript oder anderen relevanten Programmiersprachen; erste Erfahrungen in der Extraktion von Daten aus dem SAP S/4HANA (CDS Views) und der Datenmodellierung und Entwicklung von Datenflüssen (z. B. aDSOs, CompositeProvider, Transformationen, Prozessketten); Erfahrungen in der Wohnungs- bzw. Immobilienwirtschaft sind ein großes Plus",
                    "Hohes Maß an Enthusiasmus und Spaß an der Herausforderung; Verständnis für professionelles Datenmanagement sowie Motivation und Freude an der Einführung moderner Ansätze und Technologien zur Weiterentwicklung des Datenmanagements; Kommunikationsstärke und ein hohes Maß an Selbstorganisation; sehr gute Deutschkenntnisse (C1), gute Englischkenntnisse sind von Vorteil"
                ],
                [
                    "Ein moderner Arbeitsplatz im „Herzen“ Berlins an der Spree mit einer langfristigen beruflichen Perspektiven",
                    "Eine gute und faire Vergütung sowie eine betriebliche Altersversorgung",
                    "im unbefristeten Arbeitsverhältnis",
                    "Familienfreundliche Arbeitsbedingungen",
                    "Gleitzeit, i.d.R. ein flexibles Arbeitszeitkonto",
                    "30 Tage Urlaub und die Möglichkeit mobil oder im Homeoffice zu arbeiten",
                    "Regelmäßige Entwicklungsgespräche und individuelle Weiterbildungs- und Coachingvereinbarungen",
                    "Viele „Inhouse“ Sportkurse, Urban-Sports Mitgliedschaft, Unternehmensevents und Bereitstellung von Fahrrädern/Autos für Dienstfahrten",
                    "Die Möglichkeit die Gewobag in Projekten u.a. zur sozialen und nachhaltigen Stadtentwicklung mitzugestalten",
                    "Rabatte bei Mitgliedschaften u.a. bei Fitnesscenter und LPG, kostenloses Kaffeeangebot"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Junior-Data-Engineer-m-w-d-Junior-Solution-Architekt-BI-m-w-d-in-Voll-oder-Teilzeit-Hamburg-Union-Investment--11923957-inline.html?rltr=5_5_25_seorl_m_1_0_0_0_0_0",
        "paragraphs": [
            "Union Investment ist bekannt für eine herausragende Expertise im Asset Management und damit eine der führenden Investmentfondsgesellschaften. Als Teil der Genossenschaftlichen FinanzGruppe bieten wir Privatpersonen sowie institutionellen Kunden seit 1956 zukunftssichere Anlagelösungen mit dem Ziel, das Vermögen unserer mehr als fünf Millionen Anleger*innen zu vermehren.",
            "Unsere Kultur ist geprägt von einem hohen Leistungsanspruch und partnerschaftlichen Miteinander. Bei uns bringen alle Mitarbeitenden ihre eigene Geschichte mit. Es ist für uns selbstverständlich, ein Arbeitsumfeld zu schaffen, in dem Menschen mit unterschiedlichen Geschlechtern, aus verschiedenen Altersgruppen, mit körperlichen Beeinträchtigungen, unterschiedlichen sexuellen Orientierungen, sozialen und kulturellen Hintergründen, ethnischen Zugehörigkeiten und Religionen ganz sie selbst sein können. Wir schätzen diese Vielfalt und lassen daraus eine Gemeinschaft entstehen, zu der alle einen wertvollen Beitrag leisten.",
            "Wir setzen alles daran, die Prozesse der Union Investment effektiver und effizienter zu gestalten und dabei auf Daten basierend bessere Entscheidungen zu treffen. Dafür bauen wir gerade die Daten- und Business Intelligence Kompetenz weiter aus. Du kannst dabei als Data Engineer in der Abteilung Fachbereichsbetreuung Immobilien am Standort Hamburg eine führende Rolle einnehmen. Aus der Gesamtabteilung heraus stellen wir IT-Systeme, IT-Applikationen und IT-Beratung für unsere internen Kunden - die Fachbereiche mit der Verantwortung für die Immobilienprozesse - zur Verfügung.",
            "Auch vielfältige Bildungshintergründe und Arbeitserfahrungen sind bei uns willkommen. Wir sind aufgeschlossen gegenüber Talenten, deren Lebenslauf auf den ersten Blick nicht hundertprozentig zu den Anforderungen in unserer Stellenanzeige passt. Wir bieten die passenden Rahmenbedingungen, ihre individuellen Potenziale vollumfänglich zu entfalten",
            "Neben unserem attraktiven Arbeitsumfeld gibt es außerdem zahlreiche weitere Benefits und Sozialleistungen wie u.a.",
            ".. und Vieles mehr!",
            "Die Leistungen können je nach Gesellschaft und Standort variieren."
        ],
        "lists": {
            "company": [
                [
                    "Union Investment",
                    "Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Verantwortung der Architektur und der strategischen Weiterentwicklung unserer DataPlattform mit verschiedenen BI Werkzeugen und Produkten",
                    "Beratung unserer internen Kunden zur Nutzung und zum Umgang mit unseren Data Warehouse Systemen",
                    "Konzeption und Entwicklung von datenbasierten Lösungen und Bereitstellung passgenauer Daten zur Entwicklung von Reports und Planungssystemen",
                    "Weiterentwicklung unserer Data Warehouse Produkte und aktive Modellierung",
                    "Verarbeitung und Aufbereitung der Daten entlang ihres gesamten Lebenszyklus in unseren Data Pipelines",
                    "Übernahme von Tests und Automatisierung von Testtätigkeiten",
                    "Entwicklung von BI-Produkte in interdisziplinären, agilen und eigenverantwortlichen Teams für die Steuerung unserer Immobilieninvestments und unserer Immobilienfonds"
                ],
                [
                    "Erste Berufserfahrung in der Konzeption und Entwicklung von BI/DWH-Lösungen",
                    "Erste Erfahrungen im Microsoft BI Tech Stack oder SAP BW Umfeld",
                    "Kenntnisse in Aufbau, Optimierung und Weiterentwicklung entlang der gesamten Data Supply Chain von der Quelle bis zum Data Mart sowie von relationalen Datenbank-Abfragesprachen bspw. SQL",
                    "Grundkenntnisse in BI-Frontend-Tools (z. B. MS Power BI, SAP SAC)",
                    "Erste Erfahrungen im modernen Produktmanagement und in agilen Arbeitsweisen",
                    "Kenntnisse mit Skript- & Programmiersprachen (z. B. Python, Java, o.a.) sind von Vorteil",
                    "Eine Arbeitsweise, geprägt von Partnerschaftlichkeit, Wertschätzung sowie Begeisterung und Teamgeist"
                ],
                [
                    "Mobiles und flexibles Arbeiten",
                    "Kostenfreies Deutschlandticket als Jobticket",
                    "Attraktive Betriebsrestaurants und Kaffeebars an den Standorten Frankfurt und Luxemburg",
                    "Bezuschusstes Mittagessen",
                    "Freie Getränke am Arbeitsplatz",
                    "Betriebliche Altersvorsorge",
                    "Vermögenswirksame Leistungen",
                    "Mitarbeiterkonditionen im Rahmen des Genossenschaftlichen Finanzverbundes",
                    "Kinderbetreuungszuschuss",
                    "Vielfältige Angebote rund um die Themen Fitness und Gesundheit (z.B. Wellpass, Interne Sportangebote und Gesundheitsvorsorge)",
                    "Diverse Leasing-Angebote (z.B. Fahrrad- oder Tech-Leasing)",
                    "Weiterbildungsangebote",
                    "Moderne Arbeitswelten, inkl. einer erstklassigen IT-Ausstattung"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Berlin-Linz-Wien-solvistas-GmbH--11908115-inline.html?rltr=6_6_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Wir, die solvistas, sind ein modernes IT-Dienstleistungsunternehmen im Bereich Data Science und Softwareentwicklung mit Standorten in Linz, Wien und Heidelberg. Unsere Kunden befinden sich in der Privatwirtschaft und im öffentlichen Sektor, wodurch viel Abwechslung gegeben ist.",
            "Wie läuft's ab?"
        ],
        "lists": {
            "company": [
                [
                    "solvistas GmbH",
                    "Berlin, Linz, Wien",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du stehst auf ETL",
                    "Du verwendest Methoden zur Überprüfung und Verbesserung der Datenqualität",
                    "Du unterstützt bei der Datenaufbereitung, Harmonisierung & Verarbeitung (Cleansing, Ingestion, …)",
                    "Du hilfst deinem Team beim Entwickeln & Optimieren von belastbaren Datenstrecken & behältst die Performance im Auge (Batchprocessing, Streams,...)",
                    "Du supportest dein Team bei der Kundenbetreuung (Requirements Engineering)"
                ],
                [
                    "Technische Ausbildung (Uni, FH, HTL, TH)",
                    "Erste Berufserfahrung",
                    "SQL/PL-SQL-Kenntnisse",
                    "Grundlegende Kenntnisse Data Profiling",
                    "Erste Erfahrungen im Bereich Datawarehousing",
                    "Deutsch auf C1 Niveau"
                ],
                [
                    "Gleitzeit ohne Kernarbeitszeit",
                    "Öffi-Zuschuss",
                    "Essenszuschuss",
                    "Regelmäßige Teamevents",
                    "... und noch vieles mehr!"
                ],
                [
                    "Interview",
                    "Einstellung",
                    "Campus (4 Wochen)",
                    "Projektstart",
                    "kontinuierliche Weiterentwicklung"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Food-Data-Engineer-m-w-d-Forschung-Entwicklung-Vollzeit-oder-Teilzeit-Bielefeld-Dr-August-Oetker-Nahrungsmittel-KG--11910029-inline.html?rltr=7_7_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Was bei uns möglich ist? Das entscheidest du. Du kannst unsere gemeinsame Zukunft aktiv mitgestalten. Wir möchten Teil von etwas Großem sein. Du auch?"
        ],
        "lists": {
            "company": [
                [
                    "Dr. August Oetker Nahrungsmittel KG",
                    "Bielefeld",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Als Food Data Engineer (m/w/d) bist du für die Betreuung der relevanten Anwendungen im Bereich Forschung & Entwicklung (F&E) sowie für die Sicherstellung der verbraucherrelevanten Daten im internationalen F&E-Umfeld verantwortlich.",
                    "Dabei übernimmst du die internationale Koordination, Bearbeitung und selbstständige Umsetzung von speziellen Projekten, insbesondere für unser Rezeptur Management System und stellst den Betrieb der Schnittstellen zur Datenübermittlung sicher.",
                    "Die eigenverantwortliche Weiterentwicklung eines internationalen Supports sowie die Durchführung von Schulung und Beratung der Anwender gehört ebenso zu deinen Aufgaben wie die Wahrnehmung spezieller Administratorfunktionen im internationalen Umfeld und die damit verbundene Benutzerpflege.",
                    "Dir obliegt der Ausbau und die Führung der internationalen Key-User und die Standardisierung von internationalen F&E-Abläufen in Bezug auf das Rezeptur Management System.",
                    "Des Weiteren unterstützt du beim Aufbau unseres Wissensmanagements und E-Learning-Systems.",
                    "Diese Position kann sowohl in Vollzeit als auch in Teilzeit im Rahmen eines Jobsharings besetzt werden."
                ],
                [
                    "Du verfügst über ein Studium der Lebensmitteltechnologie / Ökotrophologie mit entsprechender IT-Affinität oder Angewandter Informatik und besitzt gute Kenntnisse der Lebensmittelproduktion und/oder -entwicklung.",
                    "Alternativ hast du eine Ausbildung zur Fachkraft für Lebensmitteltechnik bzw. zum Informatikkaufmann erfolgreich abgeschlossen und bereits mehrjährige Berufserfahrung sammeln können.",
                    "Du bringst ein Grundverständnis des europäischen Lebensmittelrechts für die Berechnung deklaratorischer Daten mit. Vorteilhaft sind erste Erfahrungen mit Microsoft SQL Datenbanken.",
                    "Kommunikationsstärke und Teamfähigkeit zeichnen dich ebenso aus, wie eine strukturierte und eigenständige Arbeitsweise.",
                    "Sehr gute Sprachkenntnisse in Deutsch und Englisch sowie internationale Reisebereitschaft runden dein Profil ab."
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Aichtal-Putzmeister-Holding-GmbH--11908060-inline.html?rltr=8_8_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Putzmeister ist ein weltweit tätiges Unternehmen der Baumaschinenbranche, das als Pionier im Bereich der Mörtel- und Betonpumpen gilt. Das Know-how aus diesen größten Geschäftsfeldern wird erfolgreich auch für Industriepumpen, Tunneltechnik und Handhabungssysteme eingesetzt.",
            "In unserem Beton-Geschäftsfeld entwickeln und produzieren wir Produkte, die den Hoch-, Tief- und Ingenieurbau leichter, wirtschaftlicher und ökologisch nachhaltiger machen. Dazu gehören Produkte wie Betonpumpen, Fahrmischer, stationäre Maste sowie individuelle Lösungen für Fertigteilwerke."
        ],
        "lists": {
            "company": [
                [
                    "Putzmeister Holding GmbH",
                    "Aichtal",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit"
                ]
            ],
            "content/benefits": [
                [
                    "Entwicklung einer erstklassigen Putzmeister Enterprise Data Management Plattform, sowie maßgebliche Mitwirkung bei der strategischen Weiterentwicklung zu einem erstklassigen datengetriebenen Unternehmen",
                    "Zusammenarbeit mit Stakeholdern wie IT-, Produkt- und loT-Data-Teams, um bei deren Anforderungen an die Dateninfrastruktur zu unterstützen und ihnen bei datenbezogenen technischen Problemen zu helfen",
                    "Definition und Erstellen der Datenstrukturen als Basis für die Analysen und Berichte",
                    "Aufbau der erforderlichen Infrastruktur für die optimale Extraktion, Transformation sowie das Prüfen auf Plausibilität von Daten aus verschiedenen Datenquellen (z. B. SAP, Salesforce) unter Verwendung von Microsoft Azure und SQL-Technologien"
                ],
                [
                    "Hochschulabschluss in Informatik, Computerwissenschaften, Softwaretechnik oder verwandten technischen Bereichen",
                    "Erfahrung mit Data Engineering, Datenentwicklung und Integrationsszenarien",
                    "Erfahrung mit Enterprise Data Warehouse und/oder Data Lake Umgebungen auf Microsoft Azure Basis",
                    "Datenmodellierungspraktiken (Normalisierung, Dimensionierung usw.)",
                    "Fähigkeit zum Lesen und Erstellen von ERDs (Entity Relationship Diagrams)",
                    "Fortgeschrittene SQL/NoSQL-Erfahrung und Kenntnisse der ETL- und EL T-Techniken",
                    "Know-how bei der Bereinigung, Anreicherung und Umwandlung verschiedener Datenquellen",
                    "Erfahrung mit SAP und Siemens Solution Stack (Teamcenter / NX) sind wünschenswert",
                    "Ebenfalls wünschenswert sind Erfahrung mit der Definition oder dem Aufbau einer API Infrastruktur",
                    "Sicherer Umgang mit Kunden- und Unternehmensdaten unter Beachtung der DSGVO",
                    "Erfahrung mit automatisierten Softwaretests",
                    "Kenntnisse in der agilen Softwareentwicklung und in DevOps-Umgebungen"
                ],
                [
                    "Tarifvertragliche Vergütung",
                    "Flexible Arbeitszeiten + Möglichkeit zum Mobilen Arbeiten",
                    "Internationales Arbeitsumfeld",
                    "Betriebliche Altersvorsorge",
                    "Ladesäulen für Elektrofahrzeuge + Möglichkeit für E-Bike Leasing",
                    "Parkplatz",
                    "Mitarbeiterrabatte",
                    "Betriebsrestaurant + Essenszulage",
                    "Gesundheitsmanagement + Betriebsarzt",
                    "Sport- und Fitnessangebote",
                    "Firmenlaptop",
                    "Mitarbeiterevents",
                    "Unterstützung bei Weiterbildung"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-im-Digitalisierungs-und-Prozessmanagement-Hamburg-Bildungsbau-Hamburg--11903999-inline.html?rltr=9_9_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Unsere Büros befinden sich in attraktiver Innenstadtlage an der Stadthausbrücke, nur wenige Minuten von Jungfernstieg und Rathausmarkt entfernt.",
            "Erforderlich",
            "Vorteilhaft"
        ],
        "lists": {
            "company": [
                [
                    "Bildungsbau Hamburg",
                    "Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du gestaltest und optimierst Datenstrukturen zur Unterstützung der Anforderungen und erstellst und pflegst Datenmodelle, die eine effiziente Datenverarbeitung und -analyse ermöglichen.",
                    "Du entwickelst und implementierst ETL-Pipelines zur automatisierten Datenverarbeitung und optimierst Abfragen zur Verbesserung der Performance und Effizienz bei der Datenanalyse.",
                    "Du bist für Aufbau und Wartung von Datenlagern zuständig, um die Skalierbarkeit der Dateninfrastruktur sicherzustellen und zukünftigen Anforderungen gerecht zu werden.",
                    "Du kennst die Bedeutung einer guten Datenqualität, überwachst diese entsprechend und führst Datenbereinigungen durch."
                ],
                [
                    "abgeschlossenes Bachelor-Studium der Fachrichtung Informatik oder Wirtschaftsinformatik oder gleichwertige Fähigkeiten und Erfahrungen",
                    "mindestens dreijährige Berufserfahrung auf Bachelor-Niveau in Datenanwendungen und -integrationen"
                ],
                [
                    "Erfahrung im Umgang mit Datenbanken (z. B. Microsoft SQL oder NoSQL)",
                    "sehr gute Kenntnisse in den Bereichen Datenmodellierung, Datenintegration, Datenbank-Managementsysteme und Informationsmanagement",
                    "Kenntnisse im Bereich Cloud Platform Services (AWS, Azure, GCP)",
                    "Begeisterung für Programmiersprachen (vorzugsweise Python, SQL oder Scala) und große Datenmengen",
                    "analytisches und vernetztes Denken, Kommunikationsstärke und Teamgeist"
                ],
                [
                    "großzügig bezuschusste betriebliche Altersversorgung",
                    "Krankengeldzuschuss (ab dem zweiten Beschäftigungsjahr)",
                    "30 Tage Jahresurlaub zzgl. arbeitsfreier Tage an Heiligabend und Silvester",
                    "39-Stunden-Woche mit Gleitzeitkonto und familienfreundlichen Arbeitszeiten",
                    "Möglichkeit zur regelmäßigen Arbeit im Home-Office (bis zu 60 % der Arbeitszeit)",
                    "Sonderkonditionen in zahlreichen Hamburger Schwimmbädern und Fitness-Studios",
                    "optionales Dienstfahrrad-Leasing per Entgeltumwandlung",
                    "erstklassige Lage in der Hamburger Innenstadt",
                    "kostenfreie Kindernotfallbetreuung",
                    "Bezahlung nach Entgeltgruppe 12 TV-L"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Datenarchitektur-und-ETL-Entwicklung-Roethenbach-a-d-Pegnitz-Metropolregion-Nuernberg-Diehl-Defence-GmbH-Co-KG--11902148-inline.html?rltr=10_10_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Digitale Trans­formation. Nach­haltig­keit. Friedens­sicherung. Spannende Aufgaben, an denen auch wir bei Diehl in unseren fünf Teil­konzernen Metall, Controls, Defence, Aviation und Metering und unsere über 16.000 Mit­arbeiter­innen und Mit­arbeiter mit Hochdruck arbeiten. Entdecken Sie faszinierende Techno­logien und bewerben Sie sich. In einem von Vertrauen und Mut geprägten Familien­unter­nehmen, das beständig und stabil ist – aus Tradition.",
            "Data Engineer (m/w/d) Daten­architektur und ETL-Ent­wicklung",
            "Bewer­bungen schwer­behin­derter Men­schen werden bei gleicher Eig­nung bevor­zugt be­handelt. Bei Inte­resse geben Sie bitte dazu – auf freiwilliger Basis – Ihren SB-Status bei Ihrer Bewer­bung an."
        ],
        "lists": {
            "company": [
                [
                    "Diehl Defence GmbH & Co. KG",
                    "Röthenbach a. d. Pegnitz / Metropolregion Nürnberg",
                    "Feste Anstellung",
                    "Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Sie ent­wi­ckeln ska­lier­ba­re Da­ten­ar­chi­tek­tu­ren und bau­en Da­ta La­kes so­wie Da­ta Warehou­ses auf, die per­fekt auf die An­for­de­run­gen un­se­res Un­ter­neh­mens ab­ge­stimmt sind.",
                    "Sie op­ti­mie­ren bzw. ver­wal­ten un­se­re Da­ten­ban­ken (z. B. PostgreSQL oder MS SQL) und stel­len de­ren Ef­fi­zi­enz si­cher.",
                    "Zu Ih­rem Auf­ga­ben­be­reich ge­hö­ren zudem das De­sign sowie die Im­ple­men­tie­rung von ETL-Pipe­lines, um Da­ten rei­bungs­los zu in­te­grie­ren und zu ver­ar­bei­ten.",
                    "Sie sor­gen da­für, dass Da­ten­qua­li­tät, Si­cher­heit und In­te­gri­tät stets höchs­ten Stan­dards ent­spre­chen sowie ge­setz­li­che Vor­ga­ben ein­ge­hal­ten wer­den."
                ],
                [
                    "Ein ab­ge­schlos­se­nes Stu­di­um der In­for­ma­tik, Wirt­schafts­in­for­ma­tik, Ma­the­ma­tik o. Ä. bil­det die idea­le Vor­aus­set­zung für die­se Po­si­ti­on.",
                    "Sie ver­fü­gen über mehr­jäh­ri­ge Be­rufs­er­fah­rung als Da­ta En­gi­neer oder in ei­ner ähn­li­chen Po­si­ti­on, bes­ten­falls im Ver­tei­di­gungs- oder Si­cher­heits­sek­tor.",
                    "Einen sicheren Umgang mit Da­ta La­kes, Da­ta Warehou­ses und ETL-Tools, vor­zugs­wei­se in On-Pre­mi­ses-Um­ge­bun­gen, set­zen wir voraus.",
                    "Zu­dem ha­ben Sie Er­fah­rung mit Pro­gram­mier- und Skript­spra­chen wie Py­thon, SQL, Ja­va oder Sca­le und verfügen über fließende Deutsch- sowie gute Englischkenntnisse.",
                    "Ei­ne team­o­ri­en­tier­te und selbst­stän­di­ge Ar­beits­wei­se so­wie Pro­ak­ti­vi­tät im Hin­blick auf neue Auf­ga­ben run­den Ihr Pro­fil ab."
                ],
                [
                    "Berufliche & persönliche Weiter­entwicklung",
                    "Tarifliche Vergütung",
                    "Flexible Arbeits­zeiten",
                    "Betrieb­liche Alters­vorsorge",
                    "Betrieb­liches Gesund­heits­management"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-w-m-d-Luebeck-Draegerwerk-AG-Co-KGaA--11744848-inline.html?rltr=11_11_25_seorl_m_1_0_0_0_0_0",
        "paragraphs": [
            "In Lübeck arbeiten rund 5.300 Menschen für Dräger. Hier lässt es sich gut leben. Die zweitgrößte Stadt (220.000 Einwohner) Schleswig-Holsteins bietet Ihnen eine hohe Wohnqualität, kurze Wege sowie viele Kultur- und Freizeitangebote. Von hier erreichen Sie in 20 Minuten die Ostsee und in nur einer Stunde die Elbmetropole Hamburg. Unsere Zentrale in der Moislinger Allee ist von viel Grün und Wasser umgeben. Historische Gebäude und moderne Architektur prägen das Bild. Zu Fuß erreichen Sie von hier in nur zehn Minuten die Lübecker Altstadt (UNESCO-Weltkulturerbe) und den Hauptbahnhof.",
            "Als Data Engineer entwickeln Sie im Rahmen interner Start-Ups des Bereiches „Corporate Technology & Innovation“ neue Digitalprodukte von der Idee über Prototypen bis hin zur Produktivlösung. Sie übernehmen im agilen Team die Verantwortung für die Sicherstellung der Datenverfügbarkeit und -qualität sowie des zuverlässigen Betriebs der notwendigen Infrastruktur.",
            "Sie begegnen neuen Herausforderungen mit einer durchdachten, zielführenden Herangehensweise und hoher Kommunikations- und Teamfähigkeit. Parallel begeistern Sie sich für neue Trends und engagieren sich diese umzusetzen."
        ],
        "lists": {
            "company": [
                [
                    "Drägerwerk AG & Co. KGaA",
                    "Lübeck",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Entwickeln und Pflegen von Datenpipelines und Dateninfrastrukturen zur effizienten Verarbeitung und Analyse großer Datenmengen",
                    "Zusammenarbeit mit Data Ownern und Data Scientist zur Bereitstellung notwendiger Daten für Analysen und Modelle",
                    "Erstellen automatisierter Build- und Release-Prozesse (CI/CD) sowie Provisionierung von Cloud basierten Ressourcen zur Speicherung und Verarbeitung großer Datenmengen.",
                    "Implementieren von Sicherheitsmaßnahmen zum Schutz sensibler Daten und Einhaltung von Datenschutzbestimmungen",
                    "Überwachen, Optimieren und ggf. Skalieren von existierenden Datenlösungen"
                ],
                [
                    "Erfolgreich abgeschlossenes Studium mit Schwerpunkt IT, Wirtschaftsinformatik oder Ausbildung zum Fachinformatiker mit Fachrichtung Systemintegration oder Anwendungsentwicklung",
                    "Erste bis mehrjährige Berufserfahrung im IT-Lösungsdesign, sowie Entwicklung/Test und Betrieb von Softwarelösungen",
                    "Erfahrungen mit Datenbanktechnologien (SQL & NoSQL), Datenverarbeitungsframeworks (z.B. Spark, Kafka) und Cloud Technologien (AWS oder Azure)",
                    "Fachkenntnisse im Bereich Datenmodellierung/ - architektur sowie Netzwerk & Security",
                    "Praktisches Wissen gängiger Technologien (z.B. Microservices, Container, APIs), Konzepte (z.B. CI/CD, TDD) sowie entsprechende Programmiersprachen (z.B. Python, PowerShell) und Tools (z.B. Git, MS DevOps, Kubernetes/Docker)",
                    "Verhandlungssichere Deutsch- und Englischkenntnisse"
                ],
                [
                    "Attraktive Bezahlung nach jeweiligem Tarifvertrag inkl. diverser Sonderzahlungen",
                    "30 Tage Urlaubsanspruch plus betrieblich geregelte Sonderurlaubstage",
                    "Flexible Arbeitszeiten",
                    "Mobiles Arbeiten möglich",
                    "Beiträge zur (betrieblichen) Altersvorsorge",
                    "Vergünstigte Mitarbeiteraktien",
                    "Firmenlaptop",
                    "Individuelle Einarbeitung und Onboarding",
                    "Berufliche Weiterbildungsmöglichkeiten und Coaching",
                    "Private Freizeit- und Weiterbildungsprogramme",
                    "Betriebssport und Präventionskurse",
                    "Gesundheitszentrum und Fitnessstudio",
                    "Bezuschusstes Betriebsrestaurant",
                    "Attraktive Versicherungsleistungen über unseren firmenverbundenen Makler (Mapra Assekuranzkontor GmbH)"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Entwickler-Data-Engineer-Big-Data-und-Google-Cloud-Platform-m-w-d-Frankfurt-am-Main-Duesseldorf-DZ-BANK-AG--11901772-inline.html?rltr=12_12_25_seorl_m_1_0_0_0_0_0",
        "paragraphs": [
            "Arbeiten Sie bei einer Bank, in der Sie Ihre weitere Zukunft und die Zukunft der Genossen­schafts­banken erfolgreich gestalten können. Die DZ BANK ist die zweitgrößte Geschäfts­bank Deutschlands, Spitzeninstitut der Genossen­schaftlichen FinanzGruppe Volksbanken Raiffeisenbanken, Zentralbank für mehr als 700 deutsche Genossen­schafts­banken und hat die Holding­funktion für die Unternehmen der DZ BANK Gruppe. Wir sind ein verlässlicher und leistungs­fähiger Arbeitgeber, der Ihnen neue spannende Heraus­forderungen bietet. Der digitales Denken mit konsequentem Handeln verbindet. Der Ihre Erfahrung wertschätzt und Eigen­initiative fördert. Der Innovationen voran treibt und an stetigen Wandel glaubt. Der an Zielen festhält, bis sie erreicht sind. Und der besonders partner­schaftlich denkt und arbeitet – denn wir gestalten Erfolg gemeinsam, gerne mit Ihnen.",
            "Von einer attraktiven leistungs­bezogenen Vergütung bis zur Unter­stützung bei der Kinder­betreuung. Von mobiler Arbeit mit flexiblen Arbeits­zeiten bis zur betrieblichen Alters­versorgung. Von umfangreichen Weiter­bildungs­programmen bis zu Gesundheits- und Fitness­angeboten. Bei der DZ BANK bekommen Sie viele Leistungen und Vorteile sowie optimale Bedingungen für Ihre persönliche Entwicklung. Wir leben genossen­schaftliche Werte und achten auf eine Work-Life-Balance. Haben wir Ihr Interesse geweckt? Dann freuen wir uns auf Ihre Bewerbung – und auf Sie."
        ],
        "lists": {
            "company": [
                [
                    "DZ BANK AG",
                    "Frankfurt am Main, Düsseldorf",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Als Senior Entwickler (m/w/d) übernehmen Sie die kontinuierliche Entwicklung von Data Lakes auf der Google Cloud Platform (GCP).",
                    "Dabei behalten Sie von der Anforderungs­ermittlung über Planung, Konzeption und Testing bis zum Go-Live stets das große Ganze im Blick.",
                    "Natürlich entwickeln Sie auch die Big-Data-Infrastruktur sowie deren Prozesse und Architekturen weiter – zudem bereiten Sie Fachinhalte auf und vermitteln diese verständlich im Team sowie im Fachbereich.",
                    "Sie implementieren und etablieren wieder­verwendbare Komponenten sowie Frameworks und setzen in der Software­entwicklung auf modernste Technologien sowie Methoden.",
                    "Darüber hinaus koordinieren Sie weitere Mitarbeitende – ggf. auch Externe – und arbeiten in (teils inter­nationalen) Teams nach agilen Methoden."
                ],
                [
                    "Berufspraxis in objekt­orientierter oder funktionaler Programmierung, idealer­weise in Java oder Scala, sowie Know-how in Tools der GCP (z. B. DataProc, Cloud Storage und BigQuery)",
                    "Gutes Verständnis für das Implementieren und den Aufbau von Architekturen in Data Lake oder Datawarehouse Infrastrukturen",
                    "Sehr gutes Deutsch in Wort und Schrift"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Cloud-Data-Engineer-m-w-d-Azure-und-Databricks-Frankfurt-am-Main-Koeln-Stuttgart-Muenchen-Berlin-Dresden-Hamburg-INFOMOTION-GmbH--11869152-inline.html?rltr=13_13_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Bei uns dreht sich alles um den größtmöglichen Mehrwert aus Daten - und bald auch für Dich! Vorausgesetzt, Du begeisterst Dich für Daten und verstehst Dein digitales Handwerk. So wie wir.",
            "Mit fast zwei Jahrzehnten Erfahrung sind wir eines der führenden Beratungsunternehmen in den Bereichen Data & Analytics und Data Architecture. Wir sind Problemlöser, Anbieter von nachhaltigen Lösungen und Treiber der digitalen Transformation. Über 570 erfahrene Mitarbeiterinnen und Mitarbeiter entwickeln kundenorientierte Lösungen, die bereits über 350 Kunden aus unterschiedlichen Branchen auf ihrem Weg zum Erfolg begleitet haben. Du tickst wie wir, legst Wert auf Fairness, gute Zusammenarbeit und gemeinsame Entwicklung? Und Du hast keine Lust, Dich zu verbiegen? Dann sei Du selbst. Sei ein Teil von INFOMOTION."
        ],
        "lists": {
            "company": [
                [
                    "INFOMOTION GmbH",
                    "Frankfurt am Main, Köln, Stuttgart, München, Berlin, Dresden, Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Dein Thema ist die Datenintegration, Du entwickelst Data Pipelines für die effektive Integration von Daten aus verschiedenen Quellen in die Cloud",
                    "Du Implementierst Datenpipelines zur Automatisierung von Datenbewegungen und",
                    "-transformationen, dabei geht es um Datenarchitekturkomponenten wie relationale und NoSQL-Datenbanken, Sternschemata, Data Lakes, Blob-/Dateispeicher, Data Warehouses, etc.",
                    "Du setzt Objektorientiertes Python für skalierbare Big-Data-Pipelines, ETL, Web-APIs und Microservices ein und nutzt Big-Data- oder Cloud-Integrationstechnologien wie Databricks, Azure Data Factory etc.",
                    "Du wendest DevOps-Prinzipien und -Werkzeugen wie automatisierte Tests, Deployments und CI/CD an",
                    "Du bewertest neue Technologien, Tools und Best Practices im Bereich Datenintegration und stellst so die Weiterentwicklung und den Wissensaufbau in der Organisation sicher",
                    "Die neuen Entwicklungen stellst Du auf Cloud-Plattformen wie Azure bereit."
                ],
                [
                    "Du hast ein Studium der Informatik oder eines anderen MINT-Fachbereichs abgeschlossen",
                    "Du konntest mehr als 5 Jahre nachweisbare Erfahrung als Data Engineer im Bereich Data&Analytics Lösungen (Microsoft und Databricks) oder in einer ähnlichen Position sammeln",
                    "Du verfügst über starke Kommunikationsfähigkeit und Verhandlungsgeschick in sehr gutem Deutsch und Englisch",
                    "Die Fähigkeit, komplexe Inhalte verständlich wiederzugeben, kombinierst Du mit guter Präsentationsfähigkeit",
                    "Du kennst Dich in Theorie und Praxis mit den Microsoft Azure Cloud-Technologien und Databricks aus und hast Erfahrungen in der Gestaltung von Datamanagement in der Cloud, Cloud Datenarchitekturen hast Du auch in Deinem Portfolio",
                    "Zusätzliche Pluspunkte sammelst Du, wenn du Kenntnisse im Bereich Terraform und vielleicht sogar noch zusätzlich Erfahrungen in der Softwareentwicklung mitbringst",
                    "Du hast echte Teamplayerqualitäten"
                ],
                [
                    "Hochflexible (hybride) Arbeitszeit-/ortsmodelle, 30 Tage Urlaub und (Integrated) Sabbatical-Möglichkeiten sorgen für eine ausgewogene Work-Life-Balance.",
                    "Transparente Vergütung und Karrierechancen",
                    "Erlebe einen respektvollen und fairen Umgang miteinander, der das Wohlbefinden und die Zufriedenheit unserer Mitarbeiterinnen und Mitarbeiter fördert.",
                    "Nutze unser exzellentes Wissensmanagement, unsere Academy Trainings oder lerne on the Job, um Deine Fähigkeiten kontinuierlich auszubauen und Dein Wissen mit anderen zu teilen.",
                    "Verwende unsere Grow your Talent Platform, um Deine berufliche sowie persönliche Entwicklung auf das nächste Level zu heben, um Deine Talente bei uns zu entfalten.",
                    "Entdecke Angeboten für Dein physisches und mentales Wohlbefinden. Lerne die INFOMOTION Kultur kennen, die Geselligkeit, Humor und Toleranz vereint."
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Data-Engineer-AWS-Snowflake-DBT-Python-m-w-d-Unterschleissheim-bei-Muenchen-Baader-Bank-AG--11869566-inline.html?rltr=14_14_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Die Baader Bank ist einer der führenden Partner für Wertpapier- und Banking-Dienstleistungen in Europa. Auf einer hochleistungsfähigen Plattform vereinen sich Handel und Banking in einem einzigartigen Setup unter einem Dach und bieten den besten Zugang zum Kapitalmarkt – sicher, automatisiert und skalierbar.",
            "Als familiengeführte Vollbank mit Sitz in Unterschleißheim bei München und ca. 550 Mitarbeitenden bieten wir engagierten Mitarbeitern (m/w/d) verantwortungsvolle Aufgaben in den Bereichen Market Making, Capital Markets, Brokerage, Fund Services, Account Services und Research Services.",
            "Zur Verstärkung unseres Teams suchen wir Talente sowie erfahrene Spezialisten, die zukunftsorientiert und eigenverantwortlich arbeiten.",
            "Für unseren Standort in Unterschleißheim suchen wir eine/n",
            "(Senior) Data Engineer (AWS, Snowflake, DBT, Python) (m/w/d)"
        ],
        "lists": {
            "company": [
                [
                    "Baader Bank AG",
                    "Unterschleißheim bei München",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du bist an der Weiterentwicklung unserer komplexen ELT-Transformationen und dem Aufbau von DWH-Modellen beteiligt und entwickelst gemeinsam mit dem Team unsere zukünftige Data-Mesh-Architektur.",
                    "Darüber hinaus implementierst und optimierst du ETL/ELT- und Data-Warehouse-Lösungen unter Verwendung von Cloud-Technologien wie AWS, DBT und Snowflake.",
                    "Du designst, entwickelst und wartest robuste und skalierbare Datenpipelines zum Aufbau unserer Datenplattform und DWH und unterstützt bei der Datenintegration, -transformation und -analyse.",
                    "Die Implementierung von Best Practices für Datenarchitektur, Datenmodellierung und Datenqualität, um die Integrität und Zuverlässigkeit der Daten zu gewährleisten, gehört ebenfalls zu deinen Aufgaben.",
                    "Du arbeitest mit Stakeholdern zusammen, um Anforderungen zu definieren, technische Beratung bereitzustellen und die erfolgreiche Umsetzung von Data-Engineering-Projekten sicherzustellen."
                ],
                [
                    "Du verfügst über ein erfolgreich abgeschlossenes Studium der Informatik oder eines vergleichbaren Studiengangs oder alternativ über eine erfolgreich abgeschlossene Berufsausbildung und konntest bereits einschlägige Praxiserfahrung im IT-Umfeld, idealerweise bei Banken oder Finanzdienstleistern, sammeln.",
                    "Du bringst erste Erfahrungen in der Konzeption und Implementierung von Datenbanklösungen und komplexen Transformationsprojekten mit.",
                    "Darüber hinaus verfügst du über sehr gute Kenntnisse und fundierte Erfahrungen in den Bereichen Data Modeling, ETL/ELT, DWH, Performance-Tuning und SQL.",
                    "Erfahrungen in der Python-Programmierung sowie Kenntnisse in CI/CD und DevOps sind von Vorteil.",
                    "Du hast die Fähigkeit, dich schnell in Cloud-Technologien wie AWS, Snowflake und DBT einzuarbeiten und diese zu erlernen.",
                    "Neben einer selbstständigen, strukturierten und lösungsorientierten Arbeitsweise zeichnest du dich insbesondere durch eine ausgeprägte Teamfähigkeit aus.",
                    "Sehr gute Deutsch- und gute Englischkenntnisse runden dein Profil ab."
                ],
                [
                    "Eine umfassende Einarbeitung, eine angenehme Arbeitsatmosphäre sowie ein kollegiales Team",
                    "Flexible Arbeitszeiten und die Möglichkeit zur Arbeit im Home-Office, bis zu 20 Tage pro Jahr sogar auch aus dem EU-Ausland",
                    "Möglichkeit für ein Sabbatical",
                    "30 Tage Urlaub pro Jahr, der 24.12. und der 31.12 sind zusätzlich frei",
                    "Attraktives Gehalt sowie finanzielle Zuschüsse zur Betrieblichen Altersvorsorge",
                    "Gute Erreichbarkeit mit öffentlichen Verkehrsmitteln sowie Mitarbeiterparkplätze",
                    "Bezuschussung des Deutschland-Tickets",
                    "Persönliche und fachliche Entwicklungsmöglichkeiten",
                    "Fortwährende Investition in die Fort- und Weiterbildung unserer Mitarbeiter",
                    "Bezuschusstes Betriebsrestaurant und Gesundheitsförderung",
                    "Ferienbetreuung von Mitarbeiterkindern sowie - in Kooperation mit dem pme Familienservice - Mitarbeiterunterstützung in allen Lebenslagen",
                    "Regelmäßige Mitarbeiter-Events",
                    "Flache Hierarchien, kurze Entscheidungswege sowie echten Handlungs- und Gestaltungsspielraum und die Möglichkeit eigene Ideen umzusetzen",
                    "Moderne Büroräume, innovative Technologien und agile Methoden"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineers-Remote-Global-Shopify--11801467-inline.html?rltr=15_15_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Opportunity is not evenly distributed. Shopify puts independence within reach for anyone with a dream to start a business. We propel entrepreneurs and enterprises to scale the heights of their potential. Since 2006, we’ve grown to over 8,300 employees and generated over $1 trillion in sales for millions of merchants in 175 countries.",
            "This is life-defining work that directly impacts people’s lives as much as it transforms your own. This is putting the power of the few in the hands of the many, is a future with more voices rather than fewer, and is creating more choices instead of an elite option.",
            "Ready to turn raw data into product gold? Join the team that’s making commerce better for everyone.",
            "We hire people, not resumes. If you think you’re right for the role, apply now.",
            "About the role",
            "Data Engineers at Shopify build and manage the massive (MASSIVE!) data infrastructure that powers commerce through foundational work on product analysis, dashboards, merchant-facing data products, and everything in between.",
            "By designing data models and pipelines that scale, our data engineers unlock insights that protect future product development and enable us to always build a few steps ahead. Whether embedded with a product team, or part of a central data engineering group, your work will matter to merchant success and create seamless, data-informed commerce experiences for millions around the globe.",
            "Why you’ll love working at Shopify",
            "Moving at our pace brings a lot of change, complexity, and ambiguity—and a little bit of chaos. Shopifolk thrive on that and are comfortable being uncomfortable. That means Shopify is not the right place for everyone."
        ],
        "lists": {
            "company": [
                [
                    "Shopify",
                    "Remote - Global",
                    "Feste Anstellung",
                    "Vollzeit"
                ]
            ],
            "content/benefits": [
                [
                    "Feel the scale. The work of data engineers creates data-informed commerce experiences for millions around the globe.",
                    "Work with excellent peers. Working alongside other data engineers allows you to challenge each other (and peer-vet analysis) to set the standard for excellence, and work with elite levels of care to keep the quality high."
                ],
                [
                    "Convert raw data into impact. Manipulate massive data sets into product insight gold to fuel a wide variety of data products for merchants and Shopify builders."
                ],
                [
                    "Care deeply about what you do and about making commerce better for everyone",
                    "Excel by seeking professional and personal hypergrowth",
                    "Keep up with an unrelenting pace (the week, not the quarter)",
                    "Be resilient and resourceful in face of ambiguity and thrive on (rather than endure) change",
                    "Bring critical thought and opinion",
                    "Embrace differences and disagreement to get shit done and move forward",
                    "Work digital-first for your daily work"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Muenchen-Leipzig-BayWa-r-e-Energy-Trading-GmbH--11857780-inline.html?rltr=16_16_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Die BayWa r.e. Energy Trading GmbH ist seit vielen Jahren einer der führenden Vermarkter von grüner Energie. Wir bieten unseren Kunden ein breites Spektrum an energiebezogenen Dienstleistungen und Produkten. Neben der Direktvermarktung dezentralisierter Erneuerbarer Energien- und KWK-Anlagen unterstützen wir mit Power Purchase Agreements sowohl Anlagen mit auslaufender EEG-Förderung, als auch den weiteren Ausbau von Erneuerbaren Energien Projekten ohne Fördermechanismen. Als innovatives Unternehmen entwickeln wir unser Produktportfolio stetig weiter. Mit neuen Themen wie der Vermarktung von Batteriespeichersystemen und Elektrolyseuren sowie dem Angebot von Bürgerstrom tragen wir aktiv zur Energiewende bei. Dabei richten wir unseren Fokus nicht nur auf Deutschland, sondern bauen unsere Geschäftstätigkeiten international aus.",
            "Über die Stelle",
            "Wir suchen aufgrund unseres Wachstums zum nächstmöglichen Zeitpunkt Sie als Data Engineer (m/w/d) am Standort Leipzig oder München.",
            "Die Leistungen können je nach Standort variieren und sind nicht rechtsverbindlich.",
            "Gemeinsam streben wir nach einem höheren Ziel"
        ],
        "lists": {
            "company": [
                [
                    "BayWa r.e. Energy Trading GmbH",
                    "München, Leipzig",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Sie unterstützen den Aufbau und die Weiterentwicklung einer unternehmensweiten Datenplattform (DWH)",
                    "Sie stellen sicher, dass Daten für die Analyse und Modellierung bereitgestellt werden",
                    "Sie entwickeln und implementieren ETL-Prozesse (Extract, Transform, Load) zur Datenintegration aus verschiedenen Quellen",
                    "Sie arbeiten eng mit den anfordernden Fachbereichen zusammen, um Datenanforderungen zu verstehen und umzusetzen",
                    "Sie optimieren die Datenarchitektur und sorgen für die Automatisierung von Datenprozessen",
                    "Sie überwachen die Datenqualität und implementieren Maßnahmen zur Sicherstellung der Datenintegrität",
                    "Sie unterstützen bei der Erstellung und Pflege von Datenpipelines und Datenmodellen"
                ],
                [
                    "Sie haben ein erfolgreich abgeschlossenes Studium im Bereich Informatik, Wirtschaftsinformatik oder eine vergleichbare Ausbildung",
                    "Sie verfügen über mehrjährige Berufserfahrung als Data Engineer oder in einer ähnlichen Position",
                    "Sie haben fundierte Kenntnisse in der Datenintegration und -transformation, sowie in der Arbeit mit relationalen Datenbanken und Data Warehouses",
                    "Sie beherrschen gängige Programmiersprachen und Tools wie z.B. Python, SQL, C#, Snowflake, Informatica",
                    "Sie haben Erfahrung im Umgang mit Cloud-Plattformen (z.B. AWS, Azure, Google Cloud) und der automatisierten Verarbeitung sehr großer Datenmengen",
                    "Sie verfügen über Kenntnisse in der Datenmodellierung und im Aufbau von Datenpipelines",
                    "Sie arbeiten selbstständig und lösungsorientiert mit einem hohen Maß an Eigeninitiative",
                    "Sie verfügen über sehr gute Deutsch- und Englischkenntnisse"
                ],
                [
                    "Individueller Arbeitstag mit flexiblen Arbeitszeiten",
                    "Mobiles Arbeiten und Workation Möglichkeiten",
                    "Zahlreiche interne und externe Schulungsangebote sowie spannende Entwicklungsmöglichkeiten innerhalb des Konzerns",
                    "Umsetzung von eigenen Ideen und Gestaltungsfreiraum",
                    "Die Möglichkeit, die Energiewende mit uns voranzutreiben",
                    "Moderne Bürogebäude inkl. höhenverstellbarer Tische",
                    "Vergünstigte Konditionen für Fitnessangebote über Gympass",
                    "Zuschuss zum Deutschlandticket",
                    "Zugang zum Corporate Benefits Portal mit vielen Einkaufsvergünstigungen"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Hamburg-emetriq-GmbH--11858653-inline.html?rltr=17_17_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "emetriq, Teil der Deutschen Telekom AG, bietet datengetriebene Online-Advertising-Lösungen und setzt sich für fairen Datenzugang als Treibstoff für Innovation und Vielfalt ein. Mit unserer Expertise und Technologiekompetenz steigern wir die Präzision und Relevanz von Online-Werbung. Als Initiatoren des größten kollaborativen Datenpools in Deutschland vereinen wir über 100 Data- und Mediaexperten.",
            "Zur Verstärkung unseres Data-Teams suchen wir",
            "ab sofort",
            "einen",
            "Data Engineer (m/w/d)",
            "in Vollzeit.",
            "Du arbeitest an der Weiterentwicklung verteilter Systeme, die in Sekundenbruchteilen entscheiden, welche Werbung zu welchem Nutzer passt - und das zehntausendfach pro Minute",
            "Unsere Services laufen überwiegend in der AWS-Cloud, und du übernimmst den gesamten Prozess - von der Entwicklung über Deployment bis zur Maintenance",
            "Du experimentierst gerne mit neuen Technologien, um unser Know-how stetig zu erweitern und auf dem neuesten Stand zu halten",
            "Ob Go, Python oder Scala - du bist offen für verschiedene Programmiersprachen",
            "Unterstütze uns dabei, robuste und wartungsfreundliche Software zu entwickeln, indem du test-driven programmierst, Code Reviews durchführst und Clean Code Prinzipien lebst",
            "Du vertiefst dich gern in komplexe Probleme und teilst deine Erkenntnisse aktiv im Team für einen wertvollen Wissensaustausch",
            "Du bringst Data-Engineering-Erfahrung mit Spark und idealerweise mit Scala mit",
            "Erfahrungen mit Python, Airflow und SQL sind wünschenswert, ebenso Kenntnisse in (oder starkes Interesse an) der Code-Generierung mit Hilfe von AI",
            "Du arbeitest gerne mit Big Data im Terabyte-Bereich",
            "Clean Code, Code Reviews und agile Methoden gehören zu deinem Arbeitsalltag",
            "Du bist offen für neue Programmiersprachen und Technologien",
            "Fachlicher Austausch in Deutsch und Englisch ist für dich selbstverständlich",
            "Wir bei emetriq sind ein Team aus Experten, die gemeinsam wachsen und das Unternehmen voranbringen möchten. Unsere Arbeit basiert auf Vertrauen, Agilität, Selbstorganisation und Eigenverantwortung - ohne starre Hierarchien, aber mit klaren Entwicklungsperspektiven. Mut zur Veränderung, Arbeiten auf Augenhöhe und teamübergreifende Zusammenarbeit prägen unsere Kultur.",
            "Wir suchen Menschen, die unsere Leidenschaft für Daten und Innovation teilen.",
            "Perfektion ist nicht unser Ziel, aber Engagement und kontinuierliche Weiterentwicklung - Schritt für Schritt.",
            "Einmal pro Woche im Büro zur intensiven Zusammenarbeit. An den anderen Tagen entscheidest du selbst, ob du im Büro oder von zuhause arbeitest",
            "Keine festen Kernzeiten - arbeite nach deinen eigenen Bedürfnissen",
            "Unterstützung durch JobRad und das Deutschlandticket",
            "Telekom-Produkte zu attraktiven Konditionen und eine Benefit-Card ohne Zuzahlung",
            "Von Workshops und Strategietagen bis hin zu Sport-Events und Feierabendtreffen auf unserer Dachterrasse",
            "Kostenlose Getränke, Siebträgermaschine, Snacks und eine Dachterrasse mit Aussicht",
            "Klingt das nach deinem nächsten Schritt?",
            "Dann freuen wir uns auf deine Bewerbung und darauf, gemeinsam die Zukunft des datengetriebenen Marketings zu gestalten!"
        ],
        "lists": {
            "company": [
                [
                    "emetriq GmbH",
                    "Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du arbeitest an der Weiterentwicklung verteilter Systeme, die in Sekundenbruchteilen entscheiden, welche Werbung zu welchem Nutzer passt - und das zehntausendfach pro Minute",
                    "Unsere Services laufen überwiegend in der AWS-Cloud, und du übernimmst den gesamten Prozess - von der Entwicklung über Deployment bis zur Maintenance",
                    "Du experimentierst gerne mit neuen Technologien, um unser Know-how stetig zu erweitern und auf dem neuesten Stand zu halten",
                    "Ob Go, Python oder Scala - du bist offen für verschiedene Programmiersprachen"
                ],
                [
                    "Unterstütze uns dabei, robuste und wartungsfreundliche Software zu entwickeln, indem du test-driven programmierst, Code Reviews durchführst und Clean Code Prinzipien lebst",
                    "Du vertiefst dich gern in komplexe Probleme und teilst deine Erkenntnisse aktiv im Team für einen wertvollen Wissensaustausch"
                ],
                [
                    "Du bringst Data-Engineering-Erfahrung mit Spark und idealerweise mit Scala mit",
                    "Erfahrungen mit Python, Airflow und SQL sind wünschenswert, ebenso Kenntnisse in (oder starkes Interesse an) der Code-Generierung mit Hilfe von AI",
                    "Du arbeitest gerne mit Big Data im Terabyte-Bereich",
                    "Clean Code, Code Reviews und agile Methoden gehören zu deinem Arbeitsalltag",
                    "Du bist offen für neue Programmiersprachen und Technologien",
                    "Fachlicher Austausch in Deutsch und Englisch ist für dich selbstverständlich"
                ],
                [
                    "Einmal pro Woche im Büro zur intensiven Zusammenarbeit. An den anderen Tagen entscheidest du selbst, ob du im Büro oder von zuhause arbeitest",
                    "Keine festen Kernzeiten - arbeite nach deinen eigenen Bedürfnissen",
                    "Unterstützung durch JobRad und das Deutschlandticket",
                    "Telekom-Produkte zu attraktiven Konditionen und eine Benefit-Card ohne Zuzahlung",
                    "Von Workshops und Strategietagen bis hin zu Sport-Events und Feierabendtreffen auf unserer Dachterrasse",
                    "Kostenlose Getränke, Siebträgermaschine, Snacks und eine Dachterrasse mit Aussicht"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-f-d-Hamburg-Olympus-Europa-SE-Co-KG--11793625-inline.html?rltr=18_18_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "At Olympus, we are committed to our purpose of making people’s lives healthier, safer and more fulfilling. As a global medical technology company, we partner with healthcare professionals to provide best-in-class solutions and services for early detection, diagnosis and minimally invasive treatment, aiming to improve patient outcomes by elevating the standard of care in targeted disease states.",
            "For more than 100 years, Olympus has pursued a goal of contributing to society by producing products designed with the purpose of delivering optimal outcomes for its customers around the world.",
            "Olympus Europa, headquartered in Hamburg, Germany, serves the EMEA (Europe, Middle East, Africa) region and employs 6,900 people in 31 countries. For more information, visit our website."
        ],
        "lists": {
            "company": [
                [
                    "Olympus Europa SE & Co. KG",
                    "Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [],
                [
                    "Preference for agile software development practices",
                    "Proven ability to design scalable and efficient data models, specifically but not exclusively leveraging Data Vault",
                    "Proficiency in Python, Java, Scala and SQL",
                    "Experience with Hadoop, Spark, Kafka and ETL tools",
                    "Strong knowledge of relational and NoSQL databases",
                    "Expertise in Microsoft Azure, understanding strengths and weaknesses of the platform",
                    "Familiarity with data warehousing solutions like Snowflake and Microsoft Fabric",
                    "Proficient use of Git and CI/CD pipelines",
                    "Independent and solution-driven way of working",
                    "Strong analytical and troubleshooting abilities",
                    "Ability to convey technical concepts to non-technical stakeholders"
                ],
                [
                    "Flexible working hours, remote work possible (up to 60%)",
                    "30 days of holiday per year",
                    "Modern office and inspiring working environment",
                    "Employee restaurant with live cooking and healthy food (subsidized)",
                    "Public transport ticket (100% subsidized) or free parking space",
                    "Company sport groups and in-house company gym",
                    "Employee Assistance Program to support your health, mental and emotional well-being",
                    "Comprehensive company pension scheme",
                    "Company medical officer and vaccination offers",
                    "Childcare through our ‘Buttje & Deern’ partner",
                    "Bike leasing"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Hamburg",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Hamburg",
                    "IT jobs in Hamburg",
                    "Datenbanken jobs in Hamburg",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Guetersloh-Deutsche-Post-Adress-GmbH-Co-KG--11859142-inline.html?rltr=19_19_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Sie kennen die Post Adress noch nicht? Dabei sind wir...",
            "Wir sind ein Joint Venture der Deutschen Post und Bertelsmann und ver­einen die Kulturen zweier Weltkonzerne mit einem ganz eigenen „Post-Adress-Spirit\". Als unabhängiges und familiäres Tochterunternehmen bieten wir unseren 140 Mitarbeiterinnen und Mitarbeitern die Sicherheit zweier Großkonzerne und die Freiheit, eigene Erfolgsideen zu entwickeln.",
            "Als Nr. 1 der Branche gestalten wir den dynamischen Markt des Adressmanagements. Mit unseren Lösungen aktualisieren und veri­fizieren fast 600 Unternehmen aller Branchen und Größen ihre Kundenadressen und sorgen dafür, dass ihre Post die Empfänger erreicht.",
            "Digitalisierung, Datensicherheit und künstliche Intelligenz sind Themen, mit denen wir uns schon seit Jahren beschäftigen. Um unseren Vorsprung zu halten, investieren wir systematisch in die Fähigkeiten unserer Fachkräfte.",
            "Entfalte mit uns das Potenzial der Datenwelt von morgen als",
            "Data Engineer (m/w/d) -",
            "in Gütersloh und Home Office (bis zu 60%)",
            "Komm in unser 4-köpfiges Data Science Team. Wir sind die Pioniere des Unternehmens und stellen die Technik bereit, mit der wir gemeinsam Künstliche Intelligenz zu unserem USP entwickeln.",
            "Du hast bereits Kenntnisse in R, Python und SQL und fühlst dich sicher im Umgang mit Datenbanksystemen",
            "Du hast bereits erste Erfahrungen im Betrieb von Services in Kubernetes sowie in MLOps, einschließlich ML-Pipelines und CI/CD",
            "Du hast Lust auf Integration und das Fine-Tuning von LLMs und generativen KI-Modellen, insbesondere im Prompt Engineering"
        ],
        "lists": {
            "company": [
                [
                    "Deutsche Post Adress GmbH & Co. KG",
                    "Gütersloh",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [],
                [],
                [
                    "Du hast bereits Kenntnisse in R, Python und SQL und fühlst dich sicher im Umgang mit Datenbanksystemen"
                ],
                [],
                [
                    "Du hast bereits erste Erfahrungen im Betrieb von Services in Kubernetes sowie in MLOps, einschließlich ML-Pipelines und CI/CD",
                    "Du hast Lust auf Integration und das Fine-Tuning von LLMs und generativen KI-Modellen, insbesondere im Prompt Engineering"
                ],
                [
                    "Wir bieten",
                    "Mobiles Arbeiten (bis zu 60% im Monat) und flexible, familienfreundliche Arbeitszeiten",
                    "Weiterbildung",
                    "Feedback",
                    "Kultur",
                    "Einarbeitung",
                    "Nachhaltigkeit",
                    "Wir bieten die Nutzung von Jobrädern und Jobtickets und gemeinsame, soziale Aktionen an",
                    "Zusatzleistungen"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Gütersloh",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Gütersloh",
                    "IT jobs in Gütersloh",
                    "Datenbanken jobs in Gütersloh",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Cloud-Data-Engineer-Analytics-m-w-d-Koeln-REWE-Group--11864702-inline.html?rltr=20_20_25_seorl_m_1_0_0_0_1_0",
        "paragraphs": [
            "51063 Köln |",
            "Vollzeit, unbefristet |",
            "886406",
            "Als Geschäftsbereich Analytics der REWE Group sind wir Teil des Vorstandsressorts Customer, Analytics & Technology, mit dem wir alle strategischen, analytischen und geschäftsunterstützenden Funktionen innerhalb von Handel Deutschland unter einem Dach zusammenführen. Der Geschäftsbereich verfolgt das Ziel, Advanced Analytics sowie Artificial Intelligence als ergänzenden Werttreiber in allen wesentlichen Geschäftsentscheidungen zu etablieren. Agile Arbeitsweisen bieten die perfekte Arbeitsumgebung, um die Entwicklung analytischer Produkte und Use Cases voranzutreiben. Sei dabei, wenn AA & AI im deutschen Lebensmitteleinzelhandel auf ein neues Niveau gehoben werden!",
            "Lerne uns im",
            "Podcast",
            "näher kennen!",
            "Weitere Informationen erhältst du auf unserer Website unter",
            "www.rewe-group.com/karriere.",
            "Wir freuen uns auf deine Bewerbung mit Angabe deiner Verfügbarkeit und Gehaltsvorstellung. Bitte nutze hierzu unser Onlineformular, so erreicht deine Bewerbung direkt die richtige Ansprechperson in unserem Recruiting Center. Bewerbungsunterlagen in Papierform können wir leider nicht zurücksenden.",
            "Bewerber-Servicetelefon",
            "unter",
            "0221 149-7110",
            "zur Verfügung."
        ],
        "lists": {
            "company": [
                [
                    "REWE Group",
                    "Köln",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [],
                [
                    "Dass du technische Innovation lebst und bestrebt bist, über Technologien und Entwicklungen immer up-to-date zu sein und somit unseren Cloud-Toolstack [Snowflake, Google Cloud (Kubernetes, Composer, Dataproc, Vertex AI), Dagster, DBT], kontinuierlich weiterentwickelst.",
                    "Deine Motivation große Mengen an Daten zu verarbeiten und skalierbare Lösungen zu schaffen.",
                    "Ein abgeschlossenes Studium, idealerweise in den Fachrichtungen (Wirtschafts-) Informatik, Mathematik, Statistik oder Ingenieur- bzw. Naturwissenschaften.",
                    "Dass du bereits agil gearbeitet hast und gut vertraut mit der Methodik bist.",
                    "Dein fundiertes Wissen über SQL und relationale Datenbanken, idealerweise auch über Message Queues (insb. Kafka). Weiterhin deine fortgeschrittenen Kenntnisse über gängige Architekturen und Prozesse bei der Datenverarbeitung (z.B. ETL / ELT).",
                    "Umfassende Erfahrung mit Programmiersprachen wie Python, Erfahrung mit dem Apache Big-Data-Stack (z.B. Spark) sowie dein Wissen über Cloud-Infrastruktur und -Services.",
                    "Deine Routine bei der professionellen Softwareentwicklung und Deployments, einschließlich Versionskontrolle (Git), Testing, CI/CD und Containerisierung.",
                    "Dass du Vorkenntnisse über Data-Preprocessing und Feature-Engineering für Machine-Learning-Anwendungen vorweisen kannst."
                ],
                [
                    "Zuschüssen für Kantine und vergünstigtes Deutschlandticket sowie Vorteilen beim Fahrrad-Leasing."
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Köln",
                    "Cloud Data Engineer jobs",
                    "Datenbanken jobs",
                    "Cloud Data Engineer jobs in Köln",
                    "IT jobs in Köln",
                    "Datenbanken jobs in Köln",
                    "Data Analyst jobs",
                    "Database Engineer jobs",
                    "Unreal Engine jobs",
                    "Backend Developer jobs",
                    "React Front End Developer jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Offenburg-Markant-Gruppe--11851693-inline.html?rltr=21_21_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "Markant Gruppe",
                    "Offenburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du entwickelst und wartest ETL-Prozesse zur Integration und Transformation von Daten aus verschiedenen Quellen.",
                    "Du nutzt Azure und Microsoft Fabric, um skalierbare und sichere Datenlösungen zu implementieren.",
                    "Du setzt dbt (Data build tool) ein, um Datenpipelines zu erstellen und zu verwalten.",
                    "Du arbeitest in agilen Entwicklungsteams und beteiligst dich aktiv an Scrum-Meetings und Sprints.",
                    "Du automatisierst Daten-Workflows und entwickelst Lösungen zur Datenintegration.",
                    "Du überwachst Datenprozesse und stellst die Datenqualität durch Implementierung von Best Practices sicher.",
                    "Du arbeitest eng mit dem Business-Intelligence-Team zusammen, um Datenanforderungen zu verstehen und umzusetzen."
                ],
                [
                    "Du hast ein erfolgreich abgeschlossenes Bachelor-Studium im Bereich IT, Data Science, Data Engineering oder eine abgeschlossene Ausbildung als Fachinformatiker/in Anwendungsentwicklung.",
                    "Du besitzt idealerweise Erfahrung in gängigen BI Tools (Qlik, PowerBI).",
                    "Du verfügst über Kenntnisse mit MS Fabric, Data Engineering, DBT, Python, Power BI und Qlik.",
                    "Du denkst und handelst bereichsübergreifend und arbeitest selbstständig.",
                    "Du hast eine kommunikative Art und bist teamfähig.",
                    "Du verfügst über sehr gute Deutschkenntnisse."
                ],
                [
                    "Arbeitgeberfinanzierte betriebliche Altersvorsorge",
                    "Arbeitsplatzumgebung am Puls der Zeit (inkl. höhenverstellbarer Schreibtische)",
                    "Corporate Benefits Partner",
                    "Einladendes, arbeitgebergefördertes Betriebsrestaurant",
                    "Gleitzeitmodell zur flexiblen Arbeitszeitgestaltung",
                    "Kostenfreie Getränke (Wasser, Kaffee, Tee)",
                    "Mobiles Arbeiten",
                    "Netto-Entgelt-Optimierungsprogramm inkl. 44 € Karte"
                ]
            ],
            "unnamed_list": [
                []
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-Data-Lake-MS-SQL-Entwickler-in-bundesweit-Vonovia--11790846-inline.html?rltr=22_22_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "In deiner neuen Rolle arbeitest du aktiv an der",
            "Weiterentwicklung unserer Azure Datalake, Databricks und MS-SQL Landschaft",
            "in enger Verbindung zu unserer SAP-Systemwelt mit. Dabei sind deinem",
            "Innovationsgeist",
            "keine Grenzen gesetzt und du kannst dich",
            "zukunftsorientiert",
            ",",
            "fachlich wie architektonisch",
            "einbringen.",
            "Fachlich sowie persönlich - Deine Qualifikationen sind überzeugend."
        ],
        "lists": {
            "company": [
                [
                    "Vonovia",
                    "bundesweit",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit"
                ]
            ],
            "content/benefits": [
                [
                    "Du entwickelst, betreust und erweiterst eigenständig Datenmodelle und -Transformationen, damit lieferst du Daten z.B. für das Reporting der konzernweiten Immobilienbewertung und des gesamten Neubau-Geschäfts oder wesentlicher Data Use Cases aus dem Bereich der Künstlichen Intelligenz"
                ],
                [
                    "Du administrierst die Data Pipelines und Anwendungssysteme, bearbeitest Supportaufgaben im Umfeld von Databricks, Azure Data Factory, MS-SQL und stellst im Team den Betrieb sicher",
                    "Du wirkst aktiv bei der Weiterentwicklung des Data Engineering, Analytics- und KI-Toolstacks mit und unterstützt damit die Fortentwicklung der Datenstrategie des Konzerns"
                ],
                [
                    "Du hast dein Studium der (Wirtschafts-) Informatik erfolgreich abgeschlossen oder verfügst über eine vergleichbare Qualifikation aus der Praxis",
                    "Du bringst Berufserfahrung im Umgang mit modernen Datenbanktechnologien und in der Bewältigung komplexer Data Engineering Fragestellungen mit",
                    "Du hast fundierte Kenntnisse im MS-SQL Umfeld (Datenbankdesign und Datenmigration mit den Datenbanktools SSMS, SSIS, SSAS, Performance-Tuning)",
                    "Du bringst fundierte Kenntnisse im Aufbau von Data Lake und Cloud Architekturen, insbesondere im Umgang mit Databricks, Azure Data Factory oder vergleichbaren Technologien mit",
                    "Du kannst dich aktiv beim Aufbau von Datenmodellen und Schichtenarchitekturen für strukturierte und unstrukturierte Daten einbringen",
                    "Du kannst mehrjährige Berufserfahrung in einem Beratungshaus oder in der Unternehmens-IT nachweisen",
                    "Neben dem sicheren Umgang mit SQL und T-SQL bringst du Programmierkenntnisse in Python mit. Der Umgang mit Visual Studio und DevOps ist für Dich selbstverständlich",
                    "Du verfügst über analytische Fähigkeiten und erkennst betriebswirtschaftliche Zusammenhänge",
                    "Du sprichst und schreibst fließend Deutsch und gut Englisch",
                    "Hohe Einsatzfreude und Belastbarkeit, gutes Problemlösungsverhalten, Motivation und Team- sowie Zielorientierung runden dein Profil ab"
                ],
                [
                    "Du arbeitest in einem unbefristeten Arbeitsverhältnis in einem dynamisch wachsenden Unternehmen",
                    "Arbeiten aus dem Homeoffice heraus? Wir bieten mobiles Arbeiten mit flexiblen Arbeitszeiten. Zudem gibt es individuelle Weiterbildungsangebote und Entwicklungsmöglichkeiten",
                    "Spannende Herausforderungen und die Möglichkeit, Themen aktiv und eigenverantwortlich zu gestalten",
                    "Wir unterstützen bei der Wohnungssuche innerhalb unseres Bestands je nach Verfügbarkeit, damit du schnell und unkompliziert bei uns ankommst"
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Bayreuth-Dachau-Lehrte-bei-Hannover-TenneT-TSO-GmbH--11848614-inline.html?rltr=23_23_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "TenneT TSO GmbH",
                    "Bayreuth, Dachau, Lehrte bei Hannover",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "As of 01.04.2025",
                    "The weekly working time is 37 hours",
                    "The position is unlimited",
                    "Job interviews for this position will be (partly) in English. Please send us your application document in English as well.",
                    "Due to company closures over the Christmas holidays, feedback may be delayed by a few days."
                ],
                [
                    "Implementing and maintaining our data platforms and data infrastructure",
                    "Ensuring data quality and consistency across all data sources",
                    "Developing and maintaining our data platforms on premises and in the cloud",
                    "Developing and maintaining Application Programming Interfaces (APIs) microservices",
                    "Collaborating with software developers to integrate data infrastructure into applications",
                    "Keeping up to date with the latest data engineering technologies and best practices"
                ],
                [
                    "Bachelor's or Master's degree in Computer Science, Data Science or a related field",
                    "+5 years of experience as a Data Engineer or in a related field",
                    "+3 years of experience with big data technologies such as Hadoop, Spark or Kafka",
                    "Proficiency in Python and maybe other programming languages like Java or Scala",
                    "Experience with data modeling, data warehousing and ETL processes",
                    "Knowledge of SQL and NoSQL databases",
                    "Familiarity with cloud computing platforms such as Azure or AWS",
                    "Experience with data visualization tools such as Power BI or Tableau",
                    "You have a good command of English and German (C1)"
                ],
                [
                    "We are family friendly and flexible Flexible working hours without fixed times and home office options allow you to organize your work individually. Our external partners also provide you with support services for various phases of life - for example, in matters relating to household services or care and career.",
                    "Modern working environment",
                    "• Modern IT-tools",
                    "• Ergonomic workstations",
                    "• Very well equipped conference rooms and communication solutions that enable cross-location and cross-border collaboration",
                    "Attractive remuneration and social benefits We offer great benefits such as a salary based on our Collective Labor Agreement, an annual bonus and excellent pension scheme."
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-Financial-Decision-Management-m-w-d-Neckarsulm-meinestadt-de--11845658-inline.html?rltr=24_24_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "74172 Neckarsulm",
            "Du treibst die Weiterentwicklung und Erweiterung unserer dynamischen Decision Management Plattform voran.",
            "Du bringst mindestens 3 Jahre Berufserfahrung im Bereich Software- und/oder Data Engineering mit."
        ],
        "lists": {
            "company": [
                [
                    "meinestadt.de",
                    "Neckarsulm",
                    "Feste Anstellung",
                    "Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du treibst die Weiterentwicklung und Erweiterung unserer dynamischen Decision Management Plattform voran.",
                    "Du unterstützt uns in der Entwicklung hocheffizienter Entscheidungsmodule im Finance- und Payment-Bereich.",
                    "In enger Zusammenarbeit mit unseren Data Specialists implementierst du innovative Machine Learning Modelle.",
                    "Du stellst die hohe Qualität und Integrität der Daten innerhalb des Decision Management Systems und des Data-Mart sicher.",
                    "Du integrierst neue Datenquellen und Datenpunkte, um unsere Analysen zu vertiefen und die Entscheidungsfindung zu verbessern.",
                    "Du entwickelst und pflegst unseren Data-Mart um die Datenbasis für unsere Entscheidungen zu stärken.",
                    "Du implementierst Datenqualitätsprüfungen und -validierungen, um die Zuverlässigkeit unserer Daten zu gewährleisten.",
                    "Du optimierst die Performance und skalierst unsere Dateninfrastruktur, um den wachsenden Anforderungen gerecht zu werden.",
                    "Du konzipierst und entwickelst Prozessautomatisierungen, um unsere Arbeitsabläufe zu optimieren und unsere Ressourcen effizient einzusetzen."
                ],
                [
                    "Du bringst mindestens 3 Jahre Berufserfahrung im Bereich Software- und/oder Data Engineering mit.",
                    "Du hast ein abgeschlossenes Studium in (Wirtschafts-)Informatik, Data Science oder einem verwandten Bereich.",
                    "Du verfügst über fundierte Kenntnisse relevanter Datenbank- und Datenverarbeitungstechnologien (SQL, NoSQL - z.B. MongoDB, Cassandra -, Apache Hadoop, Apache Spark).",
                    "Du hast Erfahrung mit Datenmodellierung und -design.",
                    "Du bringst Kenntnisse von Datenintegration und -migration mit.",
                    "Du hast Erfahrung mit Cloud-Computing und -Datenverarbeitung (Microsoft Azure (z.B. Azure Data Factory, Azure Synapse), Google Cloud Platform (z.B. BigQuery, Dataflow)).",
                    "Kenntnisse im Bereich Prozessautomatisierung und Machine-Learning / KI sind von Vorteil.",
                    "Du kommunizierst sicher in Deutsch (C1) und Englisch (B2).",
                    "Du bist ein Teamplayer, der Wert auf Vertrauen, Respekt und Verbundenheit legt.",
                    "Du bist bodenständig und leistungsorientiert und bringst deine Ideen und dein Engagement in unser innovatives Unternehmen ein."
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Data-Engineer-m-w-d-Sales-Insights-Performance-Essen-ALDI-Einkauf-SE-Co-oHG--11887859-inline.html?rltr=26_1_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "ALDI Einkauf SE & Co. oHG",
                    "Essen",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Design, Entwicklung und Optimierung von skalierbaren Datenpipelines unter Verwendung von",
                    "Databricks",
                    ",",
                    "SQL",
                    "und",
                    "Python",
                    "Erstellung und Implementierung von",
                    "ETL-Prozessen",
                    ", die die Vertriebsdaten aus verschiedenen Quellen extrahieren, transformieren und für die Analyse vorbereiten",
                    "Unterstützung des Teams bei der Integration von Daten aus verschiedenen Vertriebssystemen (z. B. CRM-Systeme, ERP-Systeme)",
                    "Zusammenarbeit mit Data Scientists und Vertriebsanalysten zur Verbesserung von Berichts- und Analysetools und zur Bereitstellung von datengetriebenen Erkenntnissen",
                    "Optimierung der Performance von Datenprozessen und -pipelines zur Gewährleistung von schnellen und effizienten Datenabfragen",
                    "Weiterentwicklung von Best Practices im Bereich Datenmanagement und Datenqualität, insbesondere für vertriebsrelevante Daten",
                    "Verantwortung für die Sicherstellung der Datenintegrität, -qualität und -sicherheit in einer Cloud-basierten Umgebung"
                ],
                [
                    "Dein Studium in einem der Bereiche Mathematik, Informatik, Naturwissenschaft oder Technik (MINT) hast du erfolgreich abgeschlossen oder kannst eine vergleichbare Qualifikation vorweisen",
                    "Mindestens 5 Jahre Erfahrung als Data Engineer, idealerweise im Bereich Sales",
                    "Du hast umfangreiche Erfahrungen im Umgang mit verschiedenen Big Data Technologien insbesondere aus der Microsoft Azure Cloud (z.B. Azure Data Factory, Azure Functions, Databricks, Azure SQL Server, Azure DevOps)",
                    "Sehr gute Kenntnisse in",
                    "SQL",
                    "und",
                    "Python",
                    "Praktische Erfahrung in der Erstellung und Verwaltung von",
                    "ETL-Prozessen",
                    "für große, heterogene Datensätze",
                    "Ausgezeichnete analytische Fähigkeiten und Problemlösungsfähigkeiten",
                    "Sehr gute Kommunikationsfähigkeiten in Deutsch und Englisch, insbesondere in der Zusammenarbeit mit interdisziplinären Teams"
                ],
                [
                    "Ein attraktives Gehalt sowie 30 Urlaubstage (Vollzeit)",
                    "Flexible Arbeitszeiten und die Möglichkeit für anteiliges mobiles Arbeiten",
                    "Mobilitätsbenefits wie zum Beispiel gratis E-Tanken oder das Deutschlandticket",
                    "Vielfältige Angebote im Bereich “Healthcare & Prevention”",
                    "Ein modernes Arbeiten auf dem neuen ALDI Nord Campus mit Betriebsrestaurant und Fitnesspavillon",
                    "Ein hohes Maß an Gestaltungsspielraum mit der Möglichkeit der persönlichen Weiterentwicklung",
                    "Unschlagbare Teampower in einem leistungsstarken Arbeitsumfeld",
                    "Einen sicheren Arbeitsplatz beim Erfinder des Discounts"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Essen",
                    "Senior Sales jobs",
                    "Verkaufsberatung jobs",
                    "Senior Sales jobs in Essen",
                    "Vertrieb Und Verkauf jobs in Essen",
                    "Verkaufsberatung jobs in Essen",
                    "Key Account Manager/In jobs",
                    "Marketing jobs",
                    "Senior Sales Manager jobs",
                    "E Commerce Manager jobs",
                    "Area Sales Manager jobs",
                    "Franzoesisch jobs",
                    "Strategischer Einkaeufer jobs",
                    "Interkulturelle Kompetenz jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-Financial-Decision-Management-m-w-d-Neckarsulm-Schwarz-Corporate-Solutions--11840531-inline.html?rltr=27_2_25_seorl_m_1_0_0_0_1_0",
        "paragraphs": [
            "Du treibst die Weiterentwicklung und Erweiterung unserer dynamischen Decision Management Plattform voran.",
            "Du bringst mindestens 3 Jahre Berufserfahrung im Bereich Software- und/oder Data Engineering mit."
        ],
        "lists": {
            "company": [
                [
                    "Schwarz Corporate Solutions",
                    "Neckarsulm",
                    "Feste Anstellung",
                    "Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du treibst die Weiterentwicklung und Erweiterung unserer dynamischen Decision Management Plattform voran.",
                    "Du unterstützt uns in der Entwicklung hocheffizienter Entscheidungsmodule im Finance- und Payment-Bereich.",
                    "In enger Zusammenarbeit mit unseren Data Specialists implementierst du innovative Machine Learning Modelle.",
                    "Du stellst die hohe Qualität und Integrität der Daten innerhalb des Decision Management Systems und des Data-Mart sicher.",
                    "Du integrierst neue Datenquellen und Datenpunkte, um unsere Analysen zu vertiefen und die Entscheidungsfindung zu verbessern.",
                    "Du entwickelst und pflegst unseren Data-Mart um die Datenbasis für unsere Entscheidungen zu stärken.",
                    "Du implementierst Datenqualitätsprüfungen und -validierungen, um die Zuverlässigkeit unserer Daten zu gewährleisten.",
                    "Du optimierst die Performance und skalierst unsere Dateninfrastruktur, um den wachsenden Anforderungen gerecht zu werden.",
                    "Du konzipierst und entwickelst Prozessautomatisierungen, um unsere Arbeitsabläufe zu optimieren und unsere Ressourcen effizient einzusetzen."
                ],
                [
                    "Du bringst mindestens 3 Jahre Berufserfahrung im Bereich Software- und/oder Data Engineering mit.",
                    "Du hast ein abgeschlossenes Studium in (Wirtschafts-)Informatik, Data Science oder einem verwandten Bereich.",
                    "Du verfügst über fundierte Kenntnisse relevanter Datenbank- und Datenverarbeitungstechnologien (SQL, NoSQL - z.B. MongoDB, Cassandra -, Apache Hadoop, Apache Spark).",
                    "Du hast Erfahrung mit Datenmodellierung und -design.",
                    "Du bringst Kenntnisse von Datenintegration und -migration mit.",
                    "Du hast Erfahrung mit Cloud-Computing und -Datenverarbeitung (Microsoft Azure (z.B. Azure Data Factory, Azure Synapse), Google Cloud Platform (z.B. BigQuery, Dataflow)).",
                    "Kenntnisse im Bereich Prozessautomatisierung und Machine-Learning / KI sind von Vorteil.",
                    "Du kommunizierst sicher in Deutsch (C1) und Englisch (B2).",
                    "Du bist ein Teamplayer, der Wert auf Vertrauen, Respekt und Verbundenheit legt.",
                    "Du bist bodenständig und leistungsorientiert und bringst deine Ideen und dein Engagement in unser innovatives Unternehmen ein."
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Neckarsulm",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Neckarsulm",
                    "IT jobs in Neckarsulm",
                    "Datenbanken jobs in Neckarsulm",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--SAP-Data-Engineer-m-w-d-SAP-BW-Entwickler-m-w-d-in-Voll-oder-Teilzeit-Hamburg-Union-Investment--11779468-inline.html?rltr=28_3_25_seorl_m_1_0_0_0_0_0",
        "paragraphs": [
            "Union Investment ist bekannt für eine herausragende Expertise im Asset Management und damit eine der führenden Investmentfondsgesellschaften. Als Teil der Genossenschaftlichen FinanzGruppe bieten wir Privatpersonen sowie institutionellen Kunden seit 1956 zukunftssichere Anlagelösungen mit dem Ziel, das Vermögen unserer mehr als vier Millionen Anleger*innen zu vermehren.",
            "Unsere Kultur ist geprägt von einem hohen Leistungsanspruch und partnerschaftlichen Miteinander. Bei uns bringen alle Mitarbeitenden ihre eigene Geschichte mit. Es ist für uns selbstverständlich, ein Arbeitsumfeld zu schaffen, in dem Menschen mit unterschiedlichen Geschlechtern, aus verschiedenen Altersgruppen, mit körperlichen Beeinträchtigungen, unterschiedlichen sexuellen Orientierungen, sozialen und kulturellen Hintergründen, ethnischen Zugehörigkeiten und Religionen ganz sie selbst sein können. Wir schätzen diese Vielfalt und lassen daraus eine Gemeinschaft entstehen, zu der alle einen wertvollen Beitrag leisten.",
            "Auch vielfältige Bildungshintergründe und Arbeitserfahrungen sind bei uns willkommen. Wir sind aufgeschlossen gegenüber Talenten, deren Lebenslauf auf den ersten Blick nicht hundertprozentig zu den Anforderungen in unserer Stellenanzeige passt. Wir suchen die besten Kandidat*innen für diesen Job und bieten ihnen die passenden Rahmenbedingungen, ihre individuellen Potenziale vollumfänglich zu entfalten.",
            "Neben unserem attraktiven Arbeitsumfeld gibt es außerdem zahlreiche weitere Benefits und Sozialleistungen wie u.a.",
            ".. und Vieles mehr!",
            "Die Leistungen können je nach Gesellschaft und Standort variieren."
        ],
        "lists": {
            "company": [
                [
                    "Union Investment",
                    "Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Verantwortung Betrieb und Weiterentwicklung unserer Data Warehouse Systeme mit verschiedenen BI Werkzeugen und Produkten",
                    "Beratung unserer internen Kunden zur Nutzung und zum Umgang mit unseren Data Warehouse Systemen. Konzeption und Entwicklung datenbasierter Lösungen in verantwortlicher Rolle und Bereitstellung passgenauer Daten zur Entwicklung von Reports und Planungssystemen. Du treibst dabei das Thema datenbasierte Entscheidungen voran",
                    "Weiterentwicklung unserer Data Warehouse Produkte und Übernahme bzw. Begleitung der Modellierung",
                    "Verarbeitung und Aufbereitung der Daten entlang ihres gesamten Lebenszyklus in unseren Data Pipelines und Sicherung der Datenplausibilität und Performance durch sauberes Testen",
                    "Entwicklung von BI-Produkten in interdisziplinären, agilen und eigenverantwortlichen Teams für die Steuerung unserer Immobilieninvestments und Immobilienfonds"
                ],
                [
                    "Studium der (Wirtschafts-)Informatik und Berufserfahrung in der Konzeption und Entwicklung von BI/DWH-Lösungen",
                    "Fundierte Erfahrungen im SAP BI Umfeld",
                    "Gute Kenntnisse in Aufbau, Optimierung und Weiterentwicklung entlang der gesamten Data Supply Chain von der Quelle bis zum Data Mart sowie von Skript- & Programmiersprachen (z. B. SQL, ABAP, Python)",
                    "Grundkenntnisse in BI-Frontend-Tools (z. B. SAP SAC, MS Power BI)",
                    "Methodisches Vorgehen, objekt-orientiertes oder funktionales Design, Build, Deploy",
                    "Erfahrungen in agilen Arbeitsweisen",
                    "Kenntnisse in HANA-basierten SAP BW Landschaften, idealerweise Kenntnisse im Datenverarbeitung mit Azure Cloud Technologien und Erfahrungen in der Finanzdienstleistungsbranche",
                    "Eine Arbeitsweise, geprägt von Partnerschaftlichkeit, Wertschätzung sowie Begeisterung und Teamgeist"
                ],
                [
                    "Mobiles und flexibles Arbeiten",
                    "Kostenfreies Deutschlandticket als Jobticket",
                    "Attraktive Betriebsrestaurants und Kaffeebars an den Standorten Frankfurt und Luxemburg",
                    "Bezuschusstes Mittagessen",
                    "Freie Getränke am Arbeitsplatz",
                    "Betriebliche Altersvorsorge",
                    "Vermögenswirksame Leistungen",
                    "Mitarbeiterkonditionen im Rahmen des Genossenschaftlichen Finanzverbundes",
                    "Kinderbetreuungszuschuss",
                    "Vielfältige Angebote rund um die Themen Fitness und Gesundheit (z.B. Wellpass, Interne Sportangebote und Gesundheitsvorsorge)",
                    "Diverse Leasing-Angebote (z.B. Fahrrad- oder Tech-Leasing)",
                    "Weiterbildungsangebote",
                    "Moderne Arbeitswelten, inkl. einer erstklassigen IT-Ausstattung"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Hamburg",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Hamburg",
                    "IT jobs in Hamburg",
                    "Datenbanken jobs in Hamburg",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Cloud-Data-Engineer-all-genders-Berlin-Essen-Frankfurt-am-Main-Hamburg-Ismaning-bei-Muenchen-Karlsruhe-Koeln-Stuttgart-msg-systems-ag--11783168-inline.html?rltr=29_4_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Spannende IT-Projekte, attraktive Karrierechancen, Kontinuität, Sicherheit und Nachhaltigkeit – das alles findest du bei uns. Denn als unabhängige international agierende Unternehmensgruppe mit weltweit mehr als 10.000 Mitarbeitenden sind wir in vielen dynamischen Märkten aktiv und unterstützen unsere Kunden als starker Partner bei der digitalen Transformation.",
            "Bist du bereit, die Zukunft mitzugestalten? Dann bist du in unseren Bereichen Data & Analytics und Software Engineering genau richtig. Es erwarten dich anspruchsvolle Projekte in verschiedensten Branchen, modernste Technologien und die Zusammenarbeit mit führenden Tech-Companies wie AWS, Microsoft, Snowflake, Databricks und vielen weiteren. Gemeinsam mit dir wollen wir die Arbeitswelt von morgen verbessern."
        ],
        "lists": {
            "company": [
                [
                    "msg systems ag",
                    "Berlin, Essen, Frankfurt am Main, Hamburg, Ismaning bei München, Karlsruhe, Köln, Stuttgart",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du berätst und unterstützt unsere Kunden von der Konzeption bis hin zur Implementierung",
                    "Du entwickelst innovative Lösungen und arbeitest mit neuesten Cloud- und Big Data-Technologien",
                    "Du übernimmst schnell Verantwortung und unterstützt bei der Einarbeitung und Betreuung von Kollegen",
                    "Bei uns findest Du ein fachlich und technologisch innovatives und agiles Arbeitsumfeld, sowie exzellente Möglichkeiten zur persönlichen und technologischen Weiterentwicklung",
                    "Du bist aktiver Teil unseres interdisziplinären Wissensaustausches"
                ],
                [
                    "Mehrere erfolgreich umgesetzte Datenprojekte in einer Public Cloud (AWS, Azure, GCP), mit dem Schwerpunkt der Datenintegration/ dem Aufbau von Datenplattformen.",
                    "Du bist selbstständig und kompetent in der Anwendung von Big Data-Technologien (z.B. Databricks oder Snowflake), kennst Dich mit Datenorchestrierung Tools aus (z.B. Azure Data Factory oder AWS Glue), bist routiniert im Umgang mit Technologien der Datenpersistenz (z.B. Datenbanken oder Data Lakes) und hast bereits Erfahrung mit Data Streaming (z.B. Kafka, Flink, Spark)",
                    "Gekonnt verwendest du Python, Scala, SQL und oder andere Sprachen.",
                    "Du bist erprobt in der Verwendung von Microservices, CI/CD-Pipelines und weiteren DevOps-Werkzeuge (z.B. Terraform und oder andere IaC-Tools), als auch hinsichtlich moderner MLOps-Techniken.",
                    "Sichere Kommunikation in Wort und Schrift (Deutsch, Englisch) sowie Flexibilität und Reisebereitschaft"
                ],
                [
                    "Gelebte Kultur \"Mensch im Mittelpunkt\"",
                    "Nachhaltige Projekte & Soziales Engagement",
                    "Förderung von Diversität & Chancengleichheit",
                    "Vertrauensvoller Teamspirit & Gestaltungsfreiheit",
                    "Passgenaue Weiterentwicklung & Mentoring",
                    "Flexibles Arbeiten & Work-Life Integration",
                    "Corporate Benefits",
                    "Mobiles Arbeiten"
                ]
            ],
            "unnamed_list": [
                [
                    "Cloud Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Database Engineer jobs",
                    "Unreal Engine jobs",
                    "Backend Developer jobs",
                    "React Front End Developer jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Hamburg-HanseMerkur-Grundvermoegen-AG--11825176-inline.html?rltr=30_5_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "Die HanseMerkur Grundvermögen AG ist ein auf den deutschen Immobilienmarkt spezialisierter Asset- und Investment-Manager. Wir stehen für langfristig orientierte Immobilien-Investments und ganzheitliches Immobilienmanagement mit hanseatischer Handschrift. Fairness, Vertrauen und Zuverlässigkeit bestimmen den Umgang mit unseren Geschäftspartnern und Mitarbeitern. Rund 100 erfahrene Immobilien-Spezialisten in den Bereichen Asset- und Portfolio Management, Investment, Vermietung, Finanzierung / Beteiligungsmanagement, Controlling und Recht betreuen die Immobilien und Fonds gemeinsam, effizient und ganzheitlich. Aktuell verantworten wir ein Immobilienvermögen von über sechs Milliarden Euro."
        ],
        "lists": {
            "company": [
                [
                    "HanseMerkur Grundvermögen AG",
                    "Hamburg",
                    "Feste Anstellung",
                    "Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Konzeption, Entwicklung und Optimierung von ETL-/ELT-Prozessen zur Datenintegration in die Data Warehouse-Umgebung MS Fabric",
                    "Enge Zusammenarbeit mit den Softwareanbietern unserer proprietären Software-Systeme für den Aufbau der Datenpipelines",
                    "Aufbau und Pflege von Datenpipelines in der Microsoft Fabric-Umgebung",
                    "Sicherstellung der Datenqualität und -konsistenz durch Implementierung von Validierungs- und Monitoring-Prozessen",
                    "Zusammenarbeit mit Data Scientists, Analysten und anderen Stakeholdern, um datengetriebene Lösungen zu ermöglichen",
                    "Design und Implementierung von Datenmodellen für Reporting- und Analysezwecke, insbesondere Power BI",
                    "Performance-Tuning und Optimierung von Datenbank- und Data Warehouse-Abfragen",
                    "Dokumentation von Prozessen, Systemen und Datenarchitekturen.",
                    "Verfolgung und Einordnung neuer Trends und Entwicklungen zu Business Intelligence, Cloud-Computing, Data Analytics und Machine Learning"
                ],
                [
                    "Abgeschlossenes Fach-/ Hochschulstudium - bevorzugt in (Wirtschafts-) Informatik, Mathematik oder vergleichbare Ausbildung",
                    "Mindestens 3-5 Jahre Erfahrung in einem ähnlichen Job",
                    "Erfahrung mit dem Azure Analytics Stack (Azure Synapse, Azure Data Factory, Azure Data Lake Storage, …) oder Microsoft Fabric",
                    "Kenntnisse in der Umsetzung von Data- und Analytics-Lösungen",
                    "Vertrautheit mit ETL-/ELT-Werkzeugen und -Methoden",
                    "Verständnis von Datenmodellierungstechniken (z.B. DataVault, Star- oder Snowflake-Schema)",
                    "Gute Programmierkenntnisse (SQL / T-SQL, Python, PySpark, R, KQL) sowie Erfahrungen mit Tools zur Visualisierung von Daten wie z.B. Power BI, Qlik Sense, Tableau",
                    "Erfahrung mit Infrastructure-as-Code (IaC) wie bspw. Terraform",
                    "Ausgeprägte Kompetenz in der Analyse von Daten und der Entwicklung von neuen Use Cases",
                    "Verständnis für die Bedürfnisse und Anforderungen der relevanten Fachbereiche",
                    "Know-how im Einsatz von agilen Arbeitsmethoden",
                    "Neugier auf neue Technologien",
                    "Wille, stetig zu lernen und zu optimieren"
                ],
                [
                    "Langfristiger und sicherer Arbeitsplatz",
                    "Toller Teamgeist und gute Zusammenarbeit",
                    "Flexible Arbeitszeitmodelle",
                    "Jobrad-Leasing",
                    "Zuschüsse für öffentliche Verkehrsmittel",
                    "Vergünstigungen im Fitness- und Freizeitbereich",
                    "Kostenlose betriebliche Krankenzusatzversicherung",
                    "Marktgerechtes Vergütungspaket"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Hamburg",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Hamburg",
                    "IT jobs in Hamburg",
                    "Datenbanken jobs in Hamburg",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-Data-Warehouse-und-Visualisierung-w-m-div-Dresden-Bosch-Gruppe--11776029-inline.html?rltr=31_6_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "Möchten Sie Ihre Ideen in nutzbringende und sinnvolle Technologien verwandeln? Ob im Bereich Mobility Solutions, Consumer Goods, Industrial Technology oder Energy and Building Technology - mit uns verbessern Sie die Lebensqualität der Menschen auf der ganzen Welt. Willkommen bei Bosch.",
            "Die",
            "Robert Bosch Semiconductor Manufacturing Dresden GmbH",
            "freut sich auf Ihre Bewerbung!",
            "Die zukuenftige Personalabteilung oder der Fachbereich informiert gerne ueber den individuellen Leistungskatalog."
        ],
        "lists": {
            "company": [
                [
                    "Bosch Gruppe",
                    "Dresden",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Für unsere Datenlandschaft, bestehend aus Data Warehouse und darauf aufsetzender Visualisierungen, übernehmen Sie verschiedene Aufgaben und nutzen dabei die technischen Möglichkeiten innerhalb von Oracle Datenbanken, Big Data Clustern und Zeitreihenspeichern sowie von Business Intelligenz und Analyse Lösungen.",
                    "Sie sind verantwortlich für optimierte Datenstrukturen und erreichen eine neue Qualität der Datenverfügbarkeit in der Visualisierungs- und Anwendungsebene sowie für den Data Lifecycle.",
                    "Für die Sicherstellung eines reibungslosen Betriebes arbeiten Sie mit den IT-Administratoren und Applikationsmanagern zusammen und setzen systemseitige Standards selbständig und in hoher Qualität um.",
                    "Mit Ihrem technischen Know-How als Data Engineer verstehen Sie die Problemstellungen, erstellen kreative Vorschläge für die entsprechenden Schwerpunkte im Data Warehouse Umfeld und für eine kontinuierliche und stabile Betreibbarkeit der Datenintegrationsstrecken und der Datenplattform.",
                    "Vielfältige Anwendungsfälle erfordern innovative Lösungen, die Sie entwerfen, mit dem Team abstimmen und umsetzen.",
                    "Die Zufriedenheit der internen Kunden und Anwendungsabteilungen ist Ihr Anspruch."
                ],
                [
                    "Abgeschlossenes Hochschulstudium (Master/Diplom) im Bereich Informatik, Mathematik, Statistik, vergleichbar Studiengang oder entsprechende Berufserfahrung",
                    "Erfahrung und fundiertes Know-how in der Erstellung von Datenstrukturen, Datenstrecken und Visualisierungen in einer komplexen Datenlandschaft. Sehr gute SQL-Kenntnisse sind Voraussetzung. Kenntnisse in Halbleiterfertigung sowie grundlegende Programmierkenntnisse in einer Hochsprache (C#, C++, Java) sind von Vorteil.",
                    "teamfähig, flexibel, motiviert, belastbar, kommunikationsstark, sehr gutes Organisations- und Problemlösungsvermögen sowie ausgeprägtes Qualitätsbewusstsein",
                    "selbständig, eigenverantwortlich, ergebnis- und qualitätsorientiert sowie zuverlässig",
                    "Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift"
                ],
                [
                    "Work-Life-Balance",
                    "Gesundheit und Sport",
                    "Kinderbetreuung",
                    "Mitarbeiterrabatte",
                    "Freiraum fuer Kreativitaet",
                    "Betriebliche Sozialberatung und Pflege"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Dresden",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Dresden",
                    "IT jobs in Dresden",
                    "Datenbanken jobs in Dresden",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Big-Data-DevOps-Engineer-m-w-d-DSIDMG-Karlsruhe-Atruvia-AG--11799565-inline.html?rltr=32_7_25_seorl_m_1_0_0_0_0_0",
        "paragraphs": [
            "Wir sind der Digitalisierungspartner der genossenschaftlichen FinanzGruppe und vereinen jahrzehntelange Banking-Expertise mit moderner Informationstechnologie. Die speziell auf Banken zugeschnittenen IT-Lösungen und Leistungen reichen vom Rechenzentrumsbetrieb über das Bankverfahren agree21 bis hin zur App-Entwicklung. Dabei nutzen wir zukunftsweisende Technologien wie künstliche Intelligenz oder Smart Data und schreiben Prozessoptimierung und Regulatorik groß.",
            "Wir haben uns zum Ziel gesetzt, innovative digitale Banking- und Near-Banking-Erlebnisse für über 1.000 Banken und mehr als 30 Millionen Bankkund*innen zu ermöglichen. Daher investieren wir systematisch in das Know-how unserer mehr als 4.900 Mitarbeitenden und betrachten Nachhaltigkeit als strategisches Unternehmensziel.",
            "Unser Zusammenarbeitsmodell zeichnet sich durch eine agile, crossfunktionale Arbeitsweise in allen Unternehmensbereichen aus. Wir verbinden Menschen und Märkte von morgen - einfach. digital. sicher.",
            "Wir suchen dich für unser Geschäftsfeld Data, Security and Identity im Tribe Data Management and Governance als",
            "Big Data DevOps Engineer (m/w/d)",
            "am Standort Aschheim, Karlsruhe bzw. Münster.",
            "Nobody is perfect! Du erfüllst die Anforderungen nicht zu 100 % und hast dennoch Lust auf den Job? Kein Problem - wir gehen den Weg gemeinsam als Team - inklusive Einarbeitung und passgenauen Entwicklungsmaßnahmen!",
            "Gehaltsrahmen und Karrierelevel",
            "Associate | Professional |",
            "Specialist",
            "|",
            "Senior Specialist",
            "| Principal | Executive.",
            "Bewirb dich jetzt!",
            "Bitte nutze für deine Bewerbung ausschließlich unser Bewerbungsportal über den Button „Bewerben\".",
            "Wir freuen uns auf dich."
        ],
        "lists": {
            "company": [
                [
                    "Atruvia AG",
                    "Karlsruhe",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du arbeitest eigenverantwortlich als DevOps Engineer in einem hochmotivierten, crossfunktionalen Team. Dabei baust du mit uns die cloudbasierte Datenintegrationsplattform auf, unterstützt bei der Migration der Datenprodukte und stellst den produktiven Betrieb sicher.",
                    "Du bist für die Konzeption, Bereitstellung und Weiterentwicklung der IT-Services für die Datenintegration rund um unser Data Mesh verantwortlich.",
                    "Du bist im Rahmen des Incident- und Problemmanagementprozesses zuständig für den 2nd- sowie den 3rd-Level-Support und bist darüber hinaus bereit, gemeinsam mit deinem Team an Rufbereitschaften teilzunehmen (7 x 24 h).",
                    "Du stellst die Betriebssicherheit, Auslieferungsgeschwindigkeit sowie die Qualität der Datenintegrationsservices über den gesamten Produktlebenszyklus hinweg sicher.",
                    "Du arbeitest in einem agilen Team und hast Freude an der Mitgestaltung unserer neuen Big-Data-Architektur und der strategischen Neuausrichtung auf den Cloud-Betrieb mit OpenShift."
                ],
                [
                    "Du hast ein abgeschlossenes Studium der Informatik oder Wirtschaftsinformatik sowie langjährige einschlägige Berufserfahrung oder eine vergleichbare Qualifikation.",
                    "Du besitzt sehr gute Kenntnisse im Bereich Linux und im Betrieb von Anwendungen auf Kubernetes/OpenShift.",
                    "Du hast idealerweise auch schon Erfahrungen mit Big-Data-Technologien wie Spark gesammelt und kennst dich mit der S3-Technologie aus.",
                    "Du hast Spaß an agilen Arbeitsmethoden und kennst dich mit der Verwendung von DevOps und Infrastructure-as-Code (IaC)-Werkzeugen wie GIT, Jira und CI/CD-Pipelines aus. Gleichzeitig bist du bereit, dich in neue und komplexe Tools und Umgebungen einzuarbeiten.",
                    "Du verfügst über verhandlungssichere Deutschkenntnisse (mindestens C1-Niveau) und über gute Englischkenntnisse (B2-Niveau).",
                    "Du bist ein*e Teamplayer*in und arbeitest gerne methodisch und zielorientiert mit hohem Qualitätsanspruch. Eine strukturierte Arbeitsweise sowie Zuverlässigkeit, Verantwortungsbewusstsein und eine ausgeprägte Kundenorientierung zeichnen dich aus."
                ],
                [
                    "Wir arbeiten in einem ausgewogenen hybriden Mix aus Remote Work und Anwesenheit in modernen Bürowelten (Activity Based Working).",
                    "Mit unseren individuellen Arbeitszeitmodellen wie z. B. Teilzeit, der Wahlmöglichkeit in Vollzeit zwischen 30-40 h und unserem Lebensarbeitszeitkonto (Sabbatical und/oder Freistellung vor Rentenbeginn) findest du den passenden Ausgleich.",
                    "Wir bieten dir ein Familienbudget und unterstützen in besonderen familiären Situationen wie z. B. der Pflege von Familienangehörigen.",
                    "Du hast die Wahl zwischen Bike-Leasing, IT-Hardware-Leasing, vermögenswirksamen Leistungen und/oder einem zusätzlichen Freistellungstag sowie einer betrieblichen Altersvorsorge und weiteren Optionen.",
                    "Wir begrüßen dich bei unserer Willkommensveranstaltung #enter; zudem erwarten dich eine strukturierte Einarbeitung mit Pat*in sowie regelmäßige Feedbackgespräche mit deinem People Lead.",
                    "Mit unseren Angeboten begleiten und unterstützen wir dich u. a. durch Kooperationen mit der Familiengenossenschaft und voiio. Ernähre dich vielfältig in unseren Betriebsrestaurants und vernetze dich bei unseren Sportangeboten.",
                    "In unseren Entwicklungsdialogen besprichst du deine fachlichen, methodischen und persönlichen Karriereziele und verfolgst diese mittels unserer vielfältigen Weiterbildungsangebote.",
                    "Respektvoll, offen und ehrlich, eigenverantwortlich, füreinander und ergebnisorientiert - dabei leiten uns Teamgeist sowie der Wunsch nach Innovation und intensivem Wissensaustausch.",
                    "Als genossenschaftliches Unternehmen mit jahrzehntelanger Erfahrung sind wir Vordenker der digitalen Transformation in der Bankenwelt und systemrelevanter Arbeitgeber.",
                    "Kununu",
                    "≥",
                    "90 %."
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Karlsruhe",
                    "Big Data Engineer jobs",
                    "Softwareentwicklung jobs",
                    "Big Data Engineer jobs in Karlsruhe",
                    "IT jobs in Karlsruhe",
                    "Softwareentwicklung jobs in Karlsruhe",
                    "Data Analyst jobs",
                    "Cybersecurity jobs",
                    "Konstrukteur jobs",
                    "Machine Learning Engineer jobs",
                    "Ingenieur jobs",
                    "Python jobs",
                    "Product Owner jobs",
                    "Power BI jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Cloud-Data-Engineer-m-w-d-Mannheim-Berlin-Frankfurt-am-Main-Muenchen-Stuttgart-Hays-Interne-Karriere-bei-Uns--11862275-inline.html?rltr=33_8_25_seorl_m_1_0_0_0_1_0",
        "paragraphs": [
            "Was uns besonders macht? Unsere Kultur und das Gefühl von Teamgeist und Zugehörigkeit. Wir sind emphatisch und vielfältig und brennen für das, was wir tun. Wir lassen uns nicht durch „das haben wir schon immer so gemacht\" aufhalten und glauben daran, dass wir als Team die besten Ergebnisse erreichen - wir nennen es den Hays Spirit.",
            "Die Position kann ebenfalls in",
            "Berlin",
            ",",
            "Frankfurt",
            ",",
            "Hamburg",
            ",",
            "Köln",
            ",",
            "Mannheim",
            ",",
            "München",
            ",",
            "Stuttgart",
            "oder",
            "Wiesbaden",
            "besetzt werden. Dabei hast du die Möglichkeit entweder in unserer Niederlassung oder von zu Hause aus zu arbeiten.",
            "Worauf wartest du noch? Bewirb dich jetzt und erlebe den",
            "Hays Spirit",
            ".",
            "Hays steht für Vielfalt und setzt sich aktiv für Chancengerechtigkeit und Teilhabe ein. Alle - unabhängig von Geschlecht, sexueller Orientierung, Behinderung, Alter, Herkunft sowie kultureller und religiöser Zugehörigkeit - erhalten bei uns die gleichen Möglichkeiten. Daher laden wir alle Menschen, besonders auch Menschen mit Behinderungen dazu ein, sich bei uns zu bewerben.",
            "Je nach Berufserfahrung und/oder zusätzlicher Qualifikation sowie individueller Zielerreichung (bei Positionen mit einem variablen Gehaltsbestandteil) kann das tatsächliche Gehalt variieren und höher ausfallen als das angezeigte Gehalt bzw. die Gehaltsspanne."
        ],
        "lists": {
            "company": [
                [
                    "Hays – Interne Karriere bei Uns",
                    "Mannheim, Berlin, Frankfurt am Main, München, Stuttgart",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Als Senior Cloud Data Engineer (m/w/d) nimmst du eine Schlüsselrolle bei der unternehmensweiten Datenintegration und -bereitstellung für Stakeholder wie Business-Analysten, Data Scientists und andere Fachleute ein",
                    "Durch deinen Beitrag zur Entwicklung der Datenstrategie von Hays Deutschland sowie der Integration der deutschen Architektur in unsere globale Infrastruktur gestaltest du unsere Data-Engineering- und Data-Insights-Landschaft innerhalb unserer zukünftigen Datenarchitektur",
                    "In Zusammenarbeit mit Beratungsteams und anderen externen Lieferanten nutzt du die Daten- und Analyselandschaft von Hays, um qualitativ hochwertige Datenprodukte zu liefern",
                    "In deiner Rolle trägst du zur strategischen Entwicklung der Einheit bei, indem du dich mit unseren Data Product- und Data-Governance-Teams sowie mit der operativen IT-Systemlandschaft und den Business Stakeholdern abstimmst",
                    "Du sorgst dafür, dass unsere sich ständig weiterentwickelnde Datenproduktlandschaft auf einer soliden Basis steht, um Qualität, Effizienz und Skalierbarkeit zu ermöglichen und gleichzeitig die Einhaltung von Datenvorschriften zu gewährleisten",
                    "Dein Ziel ist es, ein agiles Umfeld mit einer ausgeprägten Produktmentalität zu fördern"
                ],
                [
                    "Du verfügst über ein erfolgreich abgeschlossenes Hochschulstudium der Informatik, Statistik, Mathematik oder eine vergleichbare Qualifikation, idealerweise mit dem Schwerpunkt Data Science",
                    "Ausgeprägte Kenntnisse in SQL, IaC sowie Cloud-Technologien (z.B. Azure Databricks) bringst du ebenfalls mit",
                    "Frameworks und Plattformen wie Spark, Airflow oder Hadoop sind dir bestens vertraut",
                    "Darüber hinaus verfügst du über fundierte Kenntnisse im agilen Projektmanagement sowie Erfahrungen in DevOps und DataOps",
                    "Eine agile Denkweise, Aufgeschlossenheit, Organisationsgeschick, ein hohes Qualitätsbewusstsein und exzellente Kommunikationsfähigkeiten in Deutsch und Englisch runden dein Profil ab"
                ],
                [
                    "Hays-Spirit",
                    "Flexibilität",
                    "Gute Gründe ins Büro zu kommen",
                    "Onboarding",
                    "Benefits"
                ]
            ],
            "unnamed_list": [
                [
                    "Cloud Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Database Engineer jobs",
                    "Unreal Engine jobs",
                    "Backend Developer jobs",
                    "React Front End Developer jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-Microsoft-Fabrics-m-w-d-Berlin-Duesseldorf-kloeckner-i-GmbH--11747676-inline.html?rltr=34_9_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "kloeckner.i GmbH",
                    "Berlin, Düsseldorf",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Weiterentwicklung und Pflege der Datenlandschaft mit besonderem Fokus auf Microsoft Fabric",
                    "Entwicklung von ETL-Prozessen und Integration neuer Datenquellen",
                    "Begleitung und Umsetzung von Projekten in enger Zusammenarbeit mit verschiedenen Stakeholdern unter Nutzung der Microsoft Fabric Plattform und anderen ETL Tools.",
                    "Aufbau und Pflege von Data-Marts"
                ],
                [
                    "Abgeschlossenes Studium in Wirtschaftsinformatik, Informatik, einer Naturwissenschaft oder eine vergleichbare Ausbildung",
                    "Einschlägige Erfahrung in der Datenintegration mit Fokus auf Business Intelligence, Data Science oder Big Data, idealerweise mit Microsoft Fabric sowie vergleichbaren Tools (z.B. Alteryx, Pentaho, Talend Data Integration)",
                    "Fortgeschrittene Kenntnisse in SQL, Python und Power BI",
                    "Affinität für moderne (Daten-)Technologien, insbesondere Microsoft Fabric, und deren effiziente Nutzung",
                    "Sehr gute Deutschkenntnisse sind zwingend erforderlich"
                ],
                [
                    "Du erhältst ein wettbewerbsfähiges Vergütungspaket und tolle Benefits wie z.B. eine vergünstigte Urban Sports Mitgliedschaft, Zuschuss zum Deutschlandticket, attraktive Angebote im Klöckner Corporate Benefits Vorteilsportal, etc.",
                    "Du arbeitest in einem internationalen, dynamischen und vielfältigen Team mit starkem Teamgeist und einer Hands-on-Mentalität, das eine traditionelle Branche digitalisiert",
                    "Du profitierst von einem breiten Angebot an individuellen Trainings, Kursen und Coachings zur optimalen persönlichen Entwicklung und du erweiterst deine Sprachkenntnisse in unseren Deutsch- und Englischkursen",
                    "Du arbeitest in einem modernen, hybriden Umfeld und gestaltest deine Arbeitszeiten (Vollzeit = 38,5 Stunden) flexibel mit Gleitzeit",
                    "Du genießt 30 Tage wohlverdienten Urlaub, begleitet von zusätzlichem Vertragsgeld",
                    "Standort Düsseldorf (in der Nähe des Flughafens) oder Berlin"
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Analytics-Engineer-m-w-d-Hamburg-Kiel-Bremen-Luebeck-Lueneburg-Obungi-GmbH--11707039-inline.html?rltr=35_10_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "Obungi GmbH",
                    "Hamburg, Kiel, Bremen, Lübeck, Lüneburg",
                    "Berufseinstieg/Trainee, Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du unterstützt Kunden dabei, Business Value aus ihren Daten zu generieren",
                    "Du implementierst",
                    "Data Platform Architekturen",
                    "in der",
                    "Microsoft Cloud (Microsoft Fabric & Azure Databricks)",
                    "Dabei bist du in die Projektarbeit von der Planung bis zur Umsetzung eingebunden"
                ],
                [
                    "Bachelor/Diplom/Master oder eine vergleichbare Ausbildung/Praxiserfahrung",
                    "Gutes Datenverständnis",
                    "Erfahrungen mit entsprechenden Tools (Microsoft oder äquivalent)",
                    "Interesse an neuen Technologien und der persönlichen Weiterentwicklung",
                    "Gute Deutsch- und Englischkenntnisse in Wort und Schrift"
                ],
                [
                    "Kenntnisse im Microsoft Analytics-Umfeld (z.B. Microsoft Fabric, Azure Synapse, Power BI, Databricks, Apache Spark etc.)",
                    "Kenntnisse zu Analytics Architekturen, Datenmodellierung, Data Governance, Data Quality",
                    "Programmierkenntnisse (z.B. Python, SQL, etc.)",
                    "Erfahrung im Umgang mit Spark und Delta-Parquet",
                    "Erfahrung mit Versionsverwaltung (z.B Git) und CI/CD"
                ],
                [
                    "Home-Office-Regelung und ca. 1x pro Woche Treffen im Hamburger Büro (du darfst aber natürlich auch 5 Tage die Woche kommen)",
                    "flexible Arbeitszeiten, Voll- oder Teilzeitmodell",
                    "Kooperation mit Urban Sports Club, 30 Tage Urlaub bei einer Fünf-Tage-Woche, Tischtennisplatte, Spielekonsole",
                    "bezahlte Fortbildungen & Zertifizierungen, Mentoren, individuelle Weiterbildungen (teilweise in USA), Einsatz modernster Technologien",
                    "flache Hierarchien, mehrtägige Offsite-Events im Ausland, Team-Events, konstruktiver und ehrlicher Umgang miteinander, großartige Menschen mit einer tollen Firmenkultur",
                    "Frisches Obst, kostenlose Getränke (Wasser, Kaffee, Schorlen und auch das Feierabend-Bier), Candy Bar",
                    "zentraler Standort zwischen Alster und Hamburg Hauptbahnhof, Jobrad oder HVV-Zuschuss"
                ]
            ],
            "unnamed_list": [
                [
                    "Data Analytics Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Industrial Engineer jobs",
                    "Junior Data Analyst jobs",
                    "Power BI jobs",
                    "Business Intelligence Analyst jobs",
                    "Computational Engineer jobs",
                    "Forschungsingenieur jobs",
                    "Embedded C jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Scientist-Engineer-w-m-d-Digital-Solutions-Braunschweig-Berlin-Stadler-Signalling-Deutschland-GmbH--11859004-inline.html?rltr=36_11_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "Stadler baut seit über 80 Jahren Züge. Mit unserer Innovations­kraft, Flexi­bilität und Zuverlässig­keit sind wir heute ein führender Hersteller von Schienen­fahrzeugen. Nebst unseren Schweizer Stand­orten arbeiten rund 14.000 Mitarbei­tende an mehreren Produktions- und Engineering-Stand­orten sowie an über 80 Service­standorten in Europa, Nord­amerika und Nord­afrika.",
            "Stadler Signalling ist das Kompetenz­zentrum für Signal­technik und Digitalisie­rung der Stadler-Gruppe mit mehreren Stand­orten in Deutsch­land, der Schweiz und in Nord­amerika. In den Bereichen Automatisiertes Fahren (ATO), Zugbeein­flussung (ETCS), Moderne Gesamt­systeme (CBTC), Stell­werke und Fahrgast­informations­systeme arbeiten unsere Teams von topqualifizierten Mitarbei­tenden an der Weiter­entwick­lung unserer Signalling-Lö­sungen.",
            "Um gemeinsam die Zukunft der Mobili­tät zu gestalten, suchen wir zur Ver­stär­kung unseres Teams",
            "unbe­fristet",
            "am Stand­ort",
            "Braunschweig oder Berlin",
            "einen",
            "Data Scientist / Engineer (w/m/d) Digital Solutions"
        ],
        "lists": {
            "company": [
                [
                    "Stadler Signalling Deutschland GmbH",
                    "Braunschweig, Berlin",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Entwicklung von Algorithmen und Software zur Nutzung von Betriebs- und Instand­haltungs­daten auf Basis von Mathematik, Statistik, Daten und Experten­wissen",
                    "Erstellung und Weiter­entwicklung hoch­performanter sowie zuverlässiger Software­konzeption und Algorithmik für branchenspezifische, daten­basierte Modellierungen und Prognosen",
                    "Anwendung von Techniken des maschinellen Lernens, z. B. Klassifikation, Regression, Natural Language Processing, Text Mining, Image Processing sowie Image und Object Recognition",
                    "Identifikation und Evaluierung von Zusammen­hängen und Trends",
                    "Aufbereitung und Anbindung von Daten­quellen diverser Daten­banken",
                    "Ver- und Bearbeitung großer Datenmengen",
                    "Ausarbeitung von Reports sowie Daten­visualisierungen bezüglich der Analyse­ergebnisse",
                    "Initiierung und Umsetzung von Sonder­themen, Projekten und System­entwicklungen",
                    "Allgemeine administrative Tätigkeiten sowie Gewähr­leistung eines effektiven Wissens­transfers",
                    "Regelmäßige Dienst­reisen nach Berlin"
                ],
                [
                    "Master­abschluss in Mathematik, Data Science, Informatik oder in einem ähnlichen Fach­gebiet",
                    "Berufs­erfahrung in vergleichbarer Position",
                    "Fundiertes mathematisches Wissen, insbesondere in Algorithmik und Statistik",
                    "Umfassende Kenntnisse skript­basierter Sprachen (Python, MATLAB oder Stata) und universellen Programmier­sprachen (z. B. C#, Java, C++, Rust)",
                    "Know-how in den Bereichen Data Analytics, Data Mining und Machine Learning",
                    "Idealerweise Expertise in der Daten­modellierung und -aufbereitung",
                    "Sehr gutes Deutsch und gutes Englisch in Wort und Schrift",
                    "Teamgeist in der Zusammen­arbeit mit Entwicklern und Technik­experten",
                    "Reise­bereitschaft"
                ],
                [
                    "Vielfältige Gesundheits­angebote",
                    "Shopping-Karte und zahlreiche Mitarbeiter­vergünstigungen",
                    "Wöchentliche After-Work-Veran­staltungen und großartige Mitarbeiter­events",
                    "Eine topmoderne Arbeits­umgebung mit neuester technischer Aus­stattung",
                    "Hoch­wertige, köstliche Speisen im haus­eigenen Betriebs­restaurant",
                    "Flache Hierar­chien und individuelle Gestaltungs­freiräume zur freien Entfaltung und Um­setzung von Ideen",
                    "Flexible Arbeits­zeiten und mobiles Arbeiten",
                    "Eine einzigartige Arbeits­atmosphäre – kollegial, familiär und freund­schaftlich"
                ]
            ],
            "unnamed_list": [
                [
                    "Data Scientist Engineer jobs",
                    "Softwareentwicklung jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Ingenieur jobs",
                    "Robotics Engineer jobs",
                    "IT Techniker jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Informatiker-in-als-Data-Engineer-im-Portfolio-Steering-Hannover-HDI-AG--11734638-inline.html?rltr=37_12_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Starte durch bei HDI Global!",
            "Als einer der welt­weit führenden Industrie­versicherer haben wir in unserer 120-jährigen Unter­nehmens­geschichte mit Pionier­geist und Gemeinschafts­sinn viele Heraus­forderungen gemeistert und sind für die Zukunft sehr gut auf­gestellt. Wir bieten Dir die Mög­lich­keit, immer wieder neue Wege zu gehen und uns so gemein­sam weiter­zu­entwickeln.",
            "Niemand ist perfekt und nicht alle Karriere­wege sind geradlinig. Bewirb Dich jetzt – auch wenn Du nicht alle Anforderungen erfüllst!"
        ],
        "lists": {
            "company": [
                [
                    "HDI AG",
                    "Hannover",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Harmonisierung und Weiter­entwicklung unserer IT-Struktur in Zusammen­arbeit mit IT-Fach­bereichen",
                    "Harmonisieren unter­schiedlicher Quell­systeme zum Auf­bau eines welt­weiten DKHs und Betreuung bestehender Prozesse",
                    "Entwicklung von ETL-Strecken für struk­turierte und unstruk­turierte Daten in Python und SQL",
                    "Einbindung von Frontendlösungen wie Power BI, Power Apps und Python Dashboards in unsere Prozesse"
                ],
                [
                    "Abgeschlossenes Studium im Bereich Infor­matik, Data Engineering, Statistik oder eine vergleich­bare Qualifikation",
                    "Erfahrung in der Arbeit mit großen Daten­mengen und Datenbank­management",
                    "Gute Kenntnisse in mindestens einer Programmier­sprache wie Python, Java oder R",
                    "Erfahrung mit relationellen Daten­banken wie MySQL, PostgreSQL oder Snowflake Vertrautheit mit Cloud-Platt­formen wie AWS, Azure oder GCP",
                    "Gute analytische- und Problem­lösungs­fähigkeiten",
                    "Hohe Eigenmotivation und Bereitschaft, sich ständig weiter­zuentwickeln und neue Techno­logien zu erlernen",
                    "Verhandlungssichere Englischkenntnisse und gute Deutsch­kenntnisse in Schrift und Wort"
                ],
                [
                    "Aktienprogramm",
                    "Wir bieten Dir jedes Jahr die Möglich­keit, Aktien der Talanx AG zu vergüns­tigten Kon­di­tionen zu erwerben.",
                    "Attraktive Konditionen",
                    "Weil Du es verdienst – wir bieten Dir unter anderem 30 Tage Urlaub, einen Tarif­vertrag und 14 Gehälter.",
                    "Betriebliche Alters­vor­sorge",
                    "Wir sorgen für unsere Mitarbeitenden vor – mit einer betrieb­lichen Alters­versorgung und vermögens­wirk­samen Leistungen.",
                    "JobRad",
                    "Du bist gerne umwelt­freundlich unter­wegs? Suche Dir Dein Wunsch­rad aus und lease es direkt über uns.",
                    "Mitarbeitendenkonditionen",
                    "Mobiles Arbeiten",
                    "Ob von zu Hause oder unterwegs – unser mobiles Arbeits­modell (bis zu 60 % mobil) bietet Dir mehr Frei­heit und Selbst­ständigkeit."
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Hannover",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Hannover",
                    "IT jobs in Hannover",
                    "Datenbanken jobs in Hannover",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Platform-Engineer-m-f-d-Ulm-Liebherr-Digital-Development-Center-GmbH--11906104-inline.html?rltr=38_13_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Data Platform Engineer (m/f/d)",
            "Job-ID 73570",
            "If you're ready to take on the challenge of enhancing our data infrastructure and contributing to our AI initiatives, we're looking for you. Join us and become a key contributor to our journey toward a data-driven future."
        ],
        "lists": {
            "company": [
                [
                    "Liebherr-Digital Development Center GmbH",
                    "Ulm",
                    "Feste Anstellung",
                    "Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Improve and extend the current analytics infrastructure (built around Databricks)",
                    "Drive the data platform by observing the fast Data and AI landscape and bringing in new ideas",
                    "Maintain our stack by extending our setup with security measures, monitoring, auditing, policies and (data) observability",
                    "Build tools, templates, and processes (e.g. CI/CD) for efficient data ingestion and management",
                    "Enable colleagues from the Liebherr Group by providing guidance, best practices and blueprint architectures",
                    "Support Data Scientists and Data Engineers with Data and AI tooling"
                ],
                [
                    "M.Sc. Computer Science or related technical field with a focus on (Data) Platform Engineering",
                    "Proficiency in building secure and scalable data platforms using cloud technologies with focus on security, networking, authentication, etc.",
                    "Proficiency with cloud providers (e.g. Azure, AWS) and container technologies (e.g. Docker, Kubernetes)",
                    "Proficiency with CI/CD (preferably GitHub Actions) and IaC (preferably Terraform / Terragrunt)",
                    "Experience with Databricks / Spark, data lakes as well as SQL- and NoSQL databases",
                    "Experience with development and operation of distributed systems",
                    "Excellent programming skills (e.g. Python or GoLang) and basic experience with Data Science or Machine Learning",
                    "Excellent spoken and written communication skills in German & English"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Ulm",
                    "Data Platform Engineer jobs",
                    "Infrastruktur jobs",
                    "Data Platform Engineer jobs in Ulm",
                    "IT jobs in Ulm",
                    "Infrastruktur jobs in Ulm"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-all-genders-Berlin-Duesseldorf-Frankfurt-am-Main-Hamburg-Muenchen-Stuttgart-PRODYNA-SE--10772144-inline.html?rltr=39_14_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "Als Data Engineer bei PRODYNA erarbeitest Du im Team komplexe Lösungen in unterschiedlichen Projekten. Unsere Kunden kommen aus Branchen wie Luftfahrt, Banken und Chemie. Der enge Kontakt zu unseren Kunden steht bei allen Projekten im Mittelpunkt. Bei PRODYNA hast Du die Möglichkeit, anspruchsvolle Projekte eigenverantwortlich zu gestalten und unsere Kunden bestmöglich zu unterstützen."
        ],
        "lists": {
            "company": [
                [
                    "PRODYNA SE",
                    "Berlin, Düsseldorf, Frankfurt am Main, Hamburg, München, Stuttgart",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du bist verantwortlich für das Design und die Konzeption moderner Datenplattformen, die skalierbar hohe Datenmengen aus Systemen integrieren und verarbeiten",
                    "Du übernimmst die Planung und Implementierung mit modernen Frameworks sowie Backendservices zur Datenbereitstellung und -nutzung",
                    "Du verantwortest selbständig die Optimierung der Pipelines sowie die Integration in Cloud Plattformen",
                    "Du implementierst Werkzeuge und Lösungen zur Sicherung der Datenqualität, zur Datenbereinigung und zur Bereitstellung aggregierter Daten für Analysen",
                    "Die Aufnahme sowie Spezifikation von Anforderungen unserer Kunden gehört ebenso in dein Aufgabengebiet"
                ],
                [
                    "Du verfügst über mehrjährige Berufserfahrung in der Softwareentwicklung, insbesondere in datengetriebenen Projekten, im Bereich Data Warehousing oder im Aufbau von Datenplattformen",
                    "Du besitzt Kenntnisse in der Entwicklung von Pipelines und Datenintegrationsstrecken (ELT/ETL, Azure Data Factory, DBT, Stored Procedures oder ähnliche Tools)",
                    "Du kennst dich mit Datenmodellierung aus und hast je nach Bereich Erfahrung mit Data Vault, Data Mesh, Kimball oder Inmon",
                    "Du bringst Kenntnisse in Big Data-Architekturen und -Technologien (Databricks, Microsoft Fabric, Azure Synapse, SQL & NoSQL Datenbanken, Spark, Kafka, Elastic, etc.) und Programmierung (Python, Scala, Java etc.) mit",
                    "Fließende Deutsch- und gute Englischkenntnisse runden dein Profil ab"
                ],
                [
                    "Vielfältige Technologie-Stacks, Projekte und TechTalks",
                    "Kennenlernen und Netzwerken mit anschließendem Mentoring-Programm",
                    "Freie Wahl von Laptop und Smartphone",
                    "Keine Hierarchie & regelmäßige Teambuilding-Events",
                    "30 Tage Urlaub, flexible Arbeitszeitmodelle, mobiles Arbeiten & Sabbatical-Option",
                    "Zahlreiche Fortbildungen plus 400 Euro pro Jahr für Online-Kurse deiner Wahl",
                    "Du hast die Wahl",
                    "Unternehmensintere Sport-Challenge, Gesundheitsmanagement und kostenlose Mitgliedschaft bei EGYM Wellpass",
                    "Umzugs- und Kindergartenzuschuss, betriebliche Altersvorsorge",
                    "Hungrig?",
                    "Wir bezuschussen dein Mittagessen, Snacks oder Einkauf mit einem Essenszuschuss"
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Hamburg-Frankfurt-Muenchen-Hannover-Koeln-Berlin-Duesseldorf-Stuttgart-Computer-Futures--11830466-inline.html?rltr=40_15_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "Computer Futures ist Teil von SThree PLC, einer der weltweit führenden Personalberatungen für die MINT-Branche. SThree ist in 15 Ländern tätig und beschäftigt weltweit über 2.600 Mitarbeiter in mehr als 45 Büros.",
            "Du begeisterst dich für das Thema Big Data und möchtest Verantwortung in Projekten übernehmen?",
            "Du hast Lust an einer modernen Open-Source-Software und skalierbarer Cloud-Infrastruktur zu arbeiten?",
            "Du möchtest gemeinsam mit den Data Scientists Self-Service BI Portale, Realtime-Scourings oder Machine Learning Modelle entwickeln?",
            "…dann habe ich die richtige Herausforderung für dich. Mein Kunde sucht ab sofort einen….",
            "Data Engineer (m/w/d)."
        ],
        "lists": {
            "company": [
                [
                    "Computer Futures",
                    "Hamburg, Frankfurt, München, Hannover, Köln, Berlin, Düsseldorf, Stuttgart",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Verantwortung für die technischen Kernkompetenzen im Bereich Data Engineering für die Cloud Plattform",
                    "Im Team werden leistungsfähige und hochverfügbare „Data Services“, wie z.B. neue Self BI Portale, Realtime-Scorings oder Machine Learning Modelle entwickelt",
                    "Definieren und implementieren von komplexer Reporting-Landschaften und Anbindung von Datenquellen über Datenintegration und Bereitstellung einer Machine Learning Infrastruktur",
                    "Erstellen von Data Pipelines und ETL-Strecken (in-und outbound)",
                    "Integration von Front-End Technologien in eine BI-Systemlandschaft sowie das Erstellen von fachlichen und technischen Konzepten"
                ],
                [
                    "Du hast ein abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation",
                    "Mindestens 3 Jahre Erfahrung in der Softwareentwicklung oder im Bereich Data Engineering",
                    "Erfahrung oder die Motivation in der Entwicklung und Konzeption von Big Data Architekturen",
                    "Sehr gute Programmier- und Skriptsprachkenntnisse in Python, sowie Datenbanken",
                    "Bereitschaft in einem agilen Arbeitsumfeld zu arbeiten",
                    "Ausgeprägte Affinität mit neuen Technologien und ein hohes Maß an Verantwortungsbewusstsein",
                    "Gute Deutschkenntnisse"
                ],
                [
                    "Modernes, innovatives und dynamisches Arbeitsumfeld",
                    "30 Urlaubstage, flexible Arbeitszeiten",
                    "Home-Office Möglichkeiten",
                    "Flache Hierarchien und kurze Entscheidungswege",
                    "Deutschland Ticket"
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Koeln-Carglass-GmbH--11840441-inline.html?rltr=25_25_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Sauber Karriere machen bei Carglass",
            "®",
            "bedeutet -",
            "- eine der Marken des Jahrhunderts weiter zum Glänzen zu bringen.",
            "Zur Unterstützung für unseres Data & Analytics Teams im Bereich Finance & Controlling suchen wir zum nächstmöglichen Zeitpunkt einen",
            "Data Engineer (m/w/d)",
            "Carglass® in Deutschland ist Spezialist für die Reparatur und den Neueinbau von Fahrzeugglas. In Deutschland beschäftigt Carglass® rund 2.100 Mitarbeiterinnen und Mitarbeiter, davon sind über 1.600 speziell geschulte Carglass®-Monteure. Etwa 250 Mitarbeiter arbeiten in der Hauptverwaltung in Köln, rund 170 Mitarbeiter sind im Customer Contact Center (Call Center) beschäftigt. Das Unternehmen bearbeitet rund 1,2 Mio. Kundenkontakte pro Jahr und hilft Autofahrern in ganz Deutschland, entweder in einem der 370 Service-Center oder unterwegs mit mehr als 240 mobilen Einheiten."
        ],
        "lists": {
            "company": [
                [
                    "Carglass GmbH",
                    "Köln",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Als Teil unseres Teams bist du für die Entwicklung, das Design und die Optimierung unserer ETL Prozesse in unserem Reporting Data Warehouse (insbesondere in Snowflake) verantwortlich.",
                    "Dein Arbeitsalltag umfasst auch die Umsetzung von Reports und Visualisierungen nach Anforderung der Fachbereiche in unseren Business Intelligence Tools (insbesondere QlikSense und Qlik View).Hierzu gehört auch die Unterstützung der Anwender im Self Service BI.",
                    "Du arbeitest an der Integration von Daten aus verschiedenen Quellen der operativen Systeme (u. a. Oracle EBS, Salesforce, Workday, etc.) in unser Data Warehouse.",
                    "Du wirkst an der Erweiterung unserer Data Marts und der Bereitstellung von strukturierten Daten mit, u. a. als Basis für advanced Analytics Modelle nach Anforderung der Data Analysten/Scientists.",
                    "Als Teil unseres Data & Analytics DevOps Teams stellst du den reibungslosen Betrieb und die tägliche Aktualisierung der Business Intelligence Toollandschaft sicher.",
                    "Im Zuge unserer Governance sorgst du für eine vollständige technische Dokumentation und Versionierung. Du stellst dabei die Einhaltung unserer Security und Data Quality Richtlinien, DSGVO Anforderungen und die Verwaltung von rollenspezifischen Zugriffsrechten sicher."
                ],
                [
                    "Auf Basis eines erfolgreich abgeschlossenen IT-technischen Studiums oder einer vergleichbaren Ausbildung verfügst Du über mehrjährige Berufserfahrung im Bereich BI und/oder Data Management.",
                    "Du hast bereits einschlägige Erfahrungen im Umgang mit BI Tools (idealerweise Qlik Sense) gesammelt und bringst ausgeprägte Kenntnisse in SQL (SnowSQL) und Datenmodellierung mit.",
                    "Kenntnisse in Python Programmierung sind von Vorteil.",
                    "Deine strukturierte, selbstständige und lösungsorientierte Arbeitsweise sowie Deine hohe Lern- und Leistungsbereitschaft zeichnen Dich ebenso aus wie ein analytisches, konzeptionelles und kundenorientiertes Denken und Handeln.",
                    "Es gelingt dir, die internen Kunden in deine Arbeitsweise als Entwickler gut einzubinden.",
                    "Es motiviert dich, dir Kenntnisse über interne Prozess und Produkte anzueignen und dieses Know How in die Weiterentwicklung unserer Datenprodukte einzubringen.",
                    "Du hast Freude daran, in dynamischen, auch internationalen Teams zu arbeiten und besitzt sehr gute Englischkenntnisse in Wort und Schrift."
                ],
                [
                    "flache Hierarchien, Duz-Kultur, Mitarbeiterevents.",
                    "Einarbeitungsplan mit Patenprogramm, Aus- und Weiterbildungsmöglichkeiten.",
                    "Home Office (inkl. IT-Ausstattung für zu Hause), Gleitzeit, Sabbatical, 30 Tage Urlaub.",
                    "Vielzahl an Sport- und Gesundheitsmaßnahmen, subventionierte Krankenzusatzversicherung, anlassbezogener Sonderurlaub.",
                    "sicherer Arbeitsplatz in einem innovativen, werte-orientiertem, wachsenden Unternehmen, vermögenswirksame Leistungen, betriebliche Altersvorsorge.",
                    "Notfallfond, Stiftung „Giving Back“, Spirit of Belron."
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Köln",
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Data Engineer jobs in Köln",
                    "IT jobs in Köln",
                    "Datenbanken jobs in Köln",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-AI-Data-Science-Engineer-m-w-d-Bochum-GBTEC-Software-AG--11785238-inline.html?rltr=41_16_25_seorl_m_0_0_0_0_1_0",
        "paragraphs": [
            "Seit mehr als 20 Jahren entwickeln wir erfolgreich innovative Softwarelösungen und begleiten Kunden weltweit in erstklassigen Beratungsprojekten. Die Zukunftsfähigkeit unserer Branche sowie die agilen Strukturen unseres Unternehmens bilden den Grundstein für weiteres, gesundes Wachstum GBTECs. Als attraktiver Arbeitgeber arbeiten wir stetig daran, das Beste für unsere GBTEChies herauszuholen. Überzeuge Dich selbst und lerne uns im Karrierebereich kennen.",
            "Als",
            "(Senior) AI / Data Science Engineer (m/w/d)",
            "übernimmst du die Konzipierung sowie Implementierung von innovativen Lösungen im Bereich Retrieval-Augmented Generation (RAG), um Large Language Models (LLMs) mit aktuellen und dynamischen Daten zu versorgen und den Einsatz unserer marktführenden BPM-Software bei unseren Kunden zu revolutionieren. Als Teamplayer bist Du Teil eines motivierten, internationalen Teams und bereit, Aufgaben eigenständig zu übernehmen und voranzutreiben."
        ],
        "lists": {
            "company": [
                [
                    "GBTEC Software AG",
                    "Bochum",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Entwicklung und Implementierung von Lösungen im Bereich",
                    "Retrieval-Augmented Generation (RAG)",
                    ", um Large Language Models (LLMs) mit aktuellen und dynamischen Daten zu versorgen.",
                    "Konzeption und Aufbau robuster Pipelines zur",
                    "Datenaufbereitung",
                    ", einschließlich Datenextraktion, -bereinigung, -transformation und -integration.",
                    "Implementierung effizienter Retrieval-Mechanismen (z. B. Vektordatenbanken), um aktuelle Informationen für LLMs bereitzustellen.",
                    "Optimierung von Schnittstellen zwischen Datenquellen und LLMs zur Integration von Echtzeitdaten ohne umfassendes Finetuning oder Neutraining.",
                    "Entwicklung von Algorithmen und Workflows, die es LLMs ermöglichen, relevante, kontextbezogene Antworten aus dynamischen Datenquellen zu generieren.",
                    "Evaluierung und Verbesserung der Effizienz und Genauigkeit von Retrieval- und Datenanreicherungsprozessen.",
                    "Enge Zusammenarbeit mit Softwareentwicklern, um innovative KI-Lösungen in Produktion zu bringen.",
                    "Dokumentation und Monitoring von Pipelines und Systemen, um eine reibungslose Nutzung und kontinuierliche Optimierung zu gewährleisten."
                ],
                [
                    "Praktische Erfahrung mit Retrieval-Augmented Generation (RAG) und Vektordatenbanken.",
                    "Kenntnisse im Umgang mit LLMs (Large Language Models) und deren Integration in produktive Umgebungen, ohne aufwändiges Training oder Finetuning.",
                    "Sehr gute Programmierkenntnisse in Python oder Java.",
                    "Verständnis für Datenbanken (relational und NoSQL) sowie Suchtechnologien (z. B. Elasticsearch).",
                    "Kenntnisse in der Entwicklung skalierbarer Systeme und Services, idealerweise in der Cloud (z. B. AWS, Google Cloud, Azure).",
                    "Erfahrung mit Methoden zur Verarbeitung unstrukturierter Daten (z. B. Dokumentenverarbeitung, Text Mining, NLP).",
                    "Sehr gute Englischkenntnisse (C1)"
                ],
                [
                    "Anspruchsvolle Aufgaben in einem modernen Softwareentwicklungsprozess in agilen, internationalen, selbst-organisierten Teams (Bochum & Spanien)",
                    "Unterstützung bei der persönlichen Weiterentwicklung durch interne, externe oder online Schulungen (z.B. Udemy) sowie Teilnahme an Konferenzen",
                    "Ein sicherer Arbeitsplatz mit vielfältigen Entwicklungsmöglichkeiten",
                    "Ein attraktives Gehaltsmodell und Sozialleistungen (VWL, BaV, Bikeleasing, Corportate Benefits, etc.)",
                    "Teamarbeit mit hohem Wissenstransfer",
                    "Flache Hierarchien, ein hochmotiviertes Arbeitsumfeld sowie eine offene und faire Unternehmenskultur",
                    "Moderne, leistungsstarke Arbeitsumgebung und Arbeitsausstattung sowie Home-Office-/Remote-Option",
                    "Attraktives Bürogebäude mit Fitnessraum und Fußballplatz sowie freien Getränken runden das Angebot ab"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Bochum",
                    "AI Engineer jobs",
                    "Softwareentwicklung jobs",
                    "AI Engineer jobs in Bochum",
                    "IT jobs in Bochum",
                    "Softwareentwicklung jobs in Bochum",
                    "Machine Learning Engineer jobs",
                    "Data Analyst jobs",
                    "Fachinformatiker jobs",
                    "Google jobs",
                    "Python jobs",
                    "Werkstudent jobs",
                    "Cybersecurity jobs",
                    "Backend Developer jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Cloud-Data-Engineer-all-genders-Berlin-Duesseldorf-Essen-Frankfurt-am-Main-Hamburg-Ismaning-bei-Muenchen-Karlsruhe-Koeln-msg-systems-ag--11783160-inline.html?rltr=42_17_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Spannende IT-Projekte, attraktive Karrierechancen, Kontinuität, Sicherheit und Nachhaltigkeit – das alles findest du bei uns. Denn als unabhängige international agierende Unternehmensgruppe mit weltweit mehr als 10.000 Mitarbeitenden sind wir in vielen dynamischen Märkten aktiv und unterstützen unsere Kunden als starker Partner bei der digitalen Transformation.",
            "Bist du bereit, die Zukunft mitzugestalten? Dann bist du in unseren Bereichen Data & Analytics und Software Engineering genau richtig. Es erwarten dich anspruchsvolle Projekte in verschiedensten Branchen, modernste Technologien und die Zusammenarbeit mit führenden Tech-Companies wie AWS, Microsoft, Snowflake, Databricks und vielen weiteren. Gemeinsam mit dir wollen wir die Arbeitswelt von morgen verbessern."
        ],
        "lists": {
            "company": [
                [
                    "msg systems ag",
                    "Berlin, Düsseldorf, Essen, Frankfurt am Main, Hamburg, Ismaning bei München, Karlsruhe, Köln,",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du berätst und unterstützen unsere Kunden von der Konzeption bis hin zur Implementierung",
                    "Du entwickelst innovative Lösungen und arbeitest mit neuesten Cloud- und Big Data-Technologien",
                    "Du übernimmst schnell Verantwortung und unterstützt bei der Einarbeitung und Betreuung von Kollegen",
                    "Bei uns findest du ein fachlich und technologisch innovatives und agiles Arbeitsumfeld, sowie exzellente Möglichkeiten zur persönlichen und technologischen Weiterentwicklung",
                    "Du bist aktiver Teil unseres interdisziplinären Wissensaustausches"
                ],
                [
                    "Du blickst auf einige erfolgreich umgesetzte Datenprojekte in einer Public Cloud (AWS, Azure, GCP), idealerweise mit dem Schwerpunkt der Datenintegration/ dem Aufbau von Datenplattformen",
                    "Du bist bewandert in der Anwendung von Big Data-Technologien (z.B. Databricks oder Snowflake), hast bereits mit Datenorchestrierung Tools gearbeitet (z.B. Azure Data Factory oder AWS Glue) und Erfahrung mit Technologien der Datenpersistenz (z.B. Datenbanken oder Data Lakes)",
                    "Mit Python, Scala und SQL hast du bereits eigenständig programmiert"
                ],
                [
                    "Gelebte Kultur \"Mensch im Mittelpunkt\"",
                    "Nachhaltige Projekte & Soziales Engagement",
                    "Förderung von Diversität & Chancengleichheit",
                    "Vertrauensvoller Teamspirit & Gestaltungsfreiheit",
                    "Passgenaue Weiterentwicklung & Mentoring",
                    "Flexibles Arbeiten & Work-Life Integration",
                    "Corporate Benefits",
                    "Mobiles Arbeiten"
                ]
            ],
            "unnamed_list": [
                [
                    "Cloud Data Engineer jobs",
                    "Datenbanken jobs",
                    "IT jobs",
                    "Data Analyst jobs",
                    "Database Engineer jobs",
                    "Unreal Engine jobs",
                    "Backend Developer jobs",
                    "React Front End Developer jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--IT-Projektmanager-Produktentwicklung-KI-Mobility-GPT-m-w-d-Informatiker-Data-Scientist-AI-Engineer-o-ae-Duesseldorf-Rheinbahn-AG--11830370-inline.html?rltr=43_18_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Die Rheinbahn steht für Flexibilität und Mobilität. Unsere Aufgabe ist die Sicherung von Mobilität für Menschen in Düsseldorf und der Region. Als größtes Nahverkehrsunternehmen im Verkehrsverbund Rhein-Ruhr (VRR) erzielen wir seit Jahren überdurchschnittliche Markterfolge.",
            "Zur Fortführung unserer Unternehmensstrategie suchen wir eine*n",
            "IT-Projektmanager Produktentwicklung KI & Mobility GPT (m⁠/⁠w⁠/⁠d) - Informatiker, Data Scientist, AI Engineer o. ä.",
            "Die Rheinbahn hat sich Chancengleichheit für alle Geschlechter und berufliche Förderung von Frauen zum Ziel gesetzt. Wir freuen uns deshalb sehr über Bewerbungen weiblicher Fachkräfte.",
            "Ausdrücklich erwünscht sind auch Bewerbungen von Menschen mit Einwanderungsgeschichte. Schwerbehinderte Menschen werden bei entsprechender Eignung bevorzugt."
        ],
        "lists": {
            "company": [
                [
                    "Rheinbahn AG",
                    "Düsseldorf",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Leitung, Begleitung und übergeordnetes Management von Digital-Projekten, insbesondere Entwicklung und Implementierung von KI/-Lösungen für digitale Services",
                    "Leitung von Projekten zur Einführung neuer Geschäftsmodelle, Produkte, Services und Mobilitätskonzepte sowie Weiterentwicklung bestehender Systeme im Bereich der künstlichen Intelligenz",
                    "Optimierung der Mobilitätsangebote mithilfe von Machine Learning, Entwicklung und Implementierung von KI-Algorithmen und -Modellen für eine verbesserte Funktion und Benutzererfahrung",
                    "Adaption und Weiterentwicklung von KI-Technologien in weitere Plattformen, Websites, Apps oder Drittanwendungen",
                    "Analyse von Mobilitätsdaten und Identifizierung von Trends zur Optimierung",
                    "Erstellung und Prüfung von neuen Projekt-/Fachkonzepten, Schulungen und Beratung der internen Teams zur Nutzung und zum Verständnis von KI-Lösungen",
                    "Zusammenarbeit mit interdisziplinären internen und externen Projekt- und Expertenteams",
                    "Mitwirkung an unternehmensweiten Projekten zu KI-Lösungen sowie bereichsübergreifende Zusammenarbeit mit anderen Fachbereichen"
                ],
                [
                    "Abgeschlossenes Studium als Master (m⁠/⁠w⁠/⁠d) der Fachrichtung Informatik, Data Science, AI Engineering oder einem vergleichbaren Bereich",
                    "Umfassende Erfahrung mit KI-Technologien, insbesondere Machine Learning und Deep Learning sowie Natural Language Processing",
                    "Erfahrung mit der Entwicklung und Implementierung von KI-Lösungen",
                    "Gute Kenntnisse in Programmiersprachen wie Python und R",
                    "Erfahrung in der Datenverarbeitung und Datenmanagement",
                    "Erfahrung mit Cloud-Plattformen wie AWS oder Azure",
                    "Erfahrung im Projektmanagement, insbesondere New Work Methodenkompetenz",
                    "Stark ausgeprägte analytische und konzeptionelle Fähigkeiten",
                    "Begeisterung für innovative Mobilität, Urbanität, Digitalisierung und Schaffung neuer Lösungen",
                    "Sehr gute Kommunikationsfähigkeiten um komplexe technische Konzepte verständlich zu erklären",
                    "Selbstständige Arbeitsweise und Entscheidungsfreude",
                    "Hohe Eigeninitiative und Verantwortungsbewusstsein",
                    "Hands-on-Mentalität und Teamfähigkeit",
                    "Permanente Lern- und Veränderungsbereitschaft"
                ],
                [
                    "Unbefristeter Arbeitsvertrag",
                    "Anspruchsvolle, spannende wie abwechslungsreiche Tätigkeit",
                    "Flexible Arbeitszeiten, mobiles Arbeiten",
                    "Anspruch auf Weihnachts-, Urlaubsgeld und Leistungsprämie",
                    "Anspruch auf Betriebsrente",
                    "Gehalt nach Tarifvertrag",
                    "Tariflicher Urlaub von 30 Tagen",
                    "FirmenTicket, modernes Betriebsrestaurant, eigener Fitnessraum und vielseitige Gesundheitsmaßnahmen, Corporate Benefits und vieles mehr"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Düsseldorf",
                    "Projektmanager/In Produktentwicklung jobs",
                    "Projektmanagement jobs",
                    "Projektmanager/In Produktentwicklung jobs in Düsseldorf",
                    "Marketing jobs in Düsseldorf",
                    "Projektmanagement jobs in Düsseldorf",
                    "Business Process Expert jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Quereinsteiger-Physiker-Mathematiker-als-Software-Engineer-Data-Analytics-mwd-Heidelberg-Remote-HMS-Analytical-Software-GmbH--10670548-inline.html?rltr=44_19_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "HMS Analytical Software GmbH",
                    "Heidelberg, Remote",
                    "Feste Anstellung",
                    "Homeoffice möglich, Teilzeit, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Während und nach Ihrer Ausbildung werden Sie bei unseren renommierten Kunden aus den Branchen Life Science, Manufacturing und Finance an innovativen Digitalisierungsprojekten mitwirken, die sich auf Bereiche wie Analytics, IoT und neue digitale Geschäftsmodelle konzentrieren.",
                    "Mithilfe Ihres erworbenen Know-hows im Bereich Data Analytics erkennen und heben Sie die Wertschöpfungspotentiale in den Daten unserer Kunden.",
                    "Mithilfe Ihres erworbenen Know-hows im Bereich Software Engineering sorgen sie dafür, diese Wertschöpfungspotentiale in Form von produktiven, sicheren und skalierbaren Systemlösungen nutzbar zu machen.",
                    "Sie entwickeln analytische IT-Systeme für und in Abstimmung mit unseren Kunden und stehen diesen mit Ihrer Expertise als Berater zur Seite.",
                    "Je nach Ausbildungspfad und Eignung können Sie als weiterführenden Karriereschritt besondere Verantwortung entweder als Projektleiter, Teamleiter oder Technical Lead / Architekt übernehmen."
                ],
                [
                    "Sehr guter Studienabschluss in Mathematik, Physik oder einem vergleichbaren Studiengang",
                    "Begeisterung für Technologie, Analytik und die digitale Transformation sowie die stetige Motivation, sich fehlendes Wissen in diesen Bereichen anzueignen - wir bieten die Möglichkeiten dafür!",
                    "Grundlagenwissen in der Programmierung und dem Software Engineering",
                    "Hohes Abstraktionsvermögen und analytische Fähigkeiten",
                    "Ausgeprägte Dialogfähigkeit in Deutsch und Englisch"
                ],
                [
                    "Hybrides Arbeiten mit Homeoffice-Ausstattung",
                    "Flexible Arbeitszeiten",
                    "Überstundenausgleich Auszahlung / Freizeit",
                    "Regelmäßige Entwicklungsgespräche",
                    "Trainings, Coachings, Workshops, Konferenzen, Fernbildungskurse",
                    "Jobticket",
                    "Fahrtzeit = Arbeitszeit",
                    "Kinderbetreuungszuschuss",
                    "Regelmäßige Audits durch berufundfamilie Service GmbH",
                    "Sonderurlaub",
                    "Sabbatical",
                    "Betriebliche Altersvorsorge",
                    "Betriebsarzt-Versorgung",
                    "Essens- und Fitnessstudio-Zuschuss",
                    "Bewegte Pausen, Achtsamkeitskurse, Pilates",
                    "Gemeinsame Mittagessen, Betriebsfeste, saisonale Aktionen, Teamevents",
                    "Obstkorb, Mittagsmenüs, Eis, Kaffee, Tee und Getränke kostenfrei"
                ]
            ],
            "unnamed_list": [
                [
                    "Software Engineer jobs",
                    "Physik jobs",
                    "Wissenschaften jobs",
                    "Software-Entwicklung jobs",
                    "Machine Learning Engineer jobs",
                    "Data Analyst jobs",
                    "Python jobs",
                    "Werkstudent jobs",
                    "Google jobs",
                    "Senior Software Engineer jobs",
                    "Java-Entwickler/In jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Platform-Engineer-m-w-d-Ostfildern-DAT-Deutsche-Automobil-Treuhand-GmbH--11792700-inline.html?rltr=45_20_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "DAT Deutsche Automobil Treuhand GmbH",
                    "Ostfildern",
                    "Feste Anstellung",
                    "Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Sie sind verantwortlich für die Entwicklung, Implementierung und Überwachung von Datenqualitätsstandards und -richtlinien",
                    "In Zusammenarbeit mit Fachabteilungen identifizieren und bewerten Sie Datenanforderungen",
                    "Sie haben die Verantwortung für die Verwaltung von Metadaten, einschließlich Definitionen, Regeln, physikalischer Manifestationen und Datenmodellen",
                    "Die Sicherstellung der Einhaltung gesetzlicher Vorschriften und interner Richtlinien bei Datenprozessen gehört ebenfalls zu Ihren Tätigkeiten",
                    "Sie unterstützen bei der Implementierung von Master Data Management und Data Governance-Tools",
                    "Aufbau und Pflege von Beziehungen zu Datenbankadministratoren, DQ-Analysten und Geschäftsanalysten",
                    "Anforderungen zu Datenbankreplikationen über Batch oder Change-Data-Capture",
                    "Sie entwickeln Tooling und Prozesse im Data Lake zur Rohdatenbeladung weiter und fördern datengetriebene Entscheidungsfindungen innerhalb der Organisation"
                ],
                [
                    "Sie verfügen über ein erfolgreich abgeschlossenes Studium, vorzugsweise in Informatik, Wirtschaftsinformatik oder einem verwandten Fachbereich",
                    "Erfahrung in der Datenverwaltung, einschließlich Qualitätskontrolle, Sicherheit und Compliance können Sie bereits vorweisen",
                    "Sie haben Kenntnisse in Datenverwaltungstools und -technologien und die Fähigkeit zur Analyse von Daten und Ableitung von Optimierungen",
                    "Erfahrung mit Authentifizierungs- und Sicherheitskonzepten sind wünschenswert",
                    "Erste Vorerfahrung mit Data Lake Architekturen wie Databricks Lakehouse sind ebenfalls von Vorteil",
                    "Sowie Vorerfahrung mit Sychronisationstools wie Azure Data Factory, Fivetran, Airflow etc.",
                    "Sie haben ausgeprägte Kommunikationsfähigkeiten und die Fähigkeit, sowohl technische als auch geschäftliche Anforderungen zu verstehen",
                    "Sie verfügen über verhandlungssichere Deutsch- und Englischkenntnisse"
                ]
            ],
            "unnamed_list": [
                [
                    "Jobs in Ostfildern",
                    "Data Platform Engineer jobs",
                    "Infrastruktur jobs",
                    "Data Platform Engineer jobs in Ostfildern",
                    "IT jobs in Ostfildern",
                    "Infrastruktur jobs in Ostfildern"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Engineer-m-w-d-Google-Cloud-Umfeld-Frankfurt-Koeln-Stuttgart-Muenchen-Hamburg-Berlin-Dresden-INFOMOTION-GmbH--11758205-inline.html?rltr=46_21_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Bei uns dreht sich alles um den größtmöglichen Mehrwert aus Daten - und bald auch für Dich! Vorausgesetzt, Du begeisterst Dich für Daten und verstehst Dein digitales Handwerk. So wie wir.",
            "Mit fast zwei Jahrzehnten Erfahrung sind wir eines der führenden Beratungsunternehmen in den Bereichen Data & Analytics und Data Architecture. Wir sind Problemlöser, Anbieter von nachhaltigen Lösungen und Treiber der digitalen Transformation. Über 570 erfahrene Mitarbeiterinnen und Mitarbeiter entwickeln kundenorientierte Lösungen, die bereits über 350 Kunden aus unterschiedlichen Branchen auf ihrem Weg zum Erfolg begleitet haben. Du tickst wie wir, legst Wert auf Fairness, gute Zusammenarbeit und gemeinsame Entwicklung? Und Du hast keine Lust, Dich zu verbiegen? Dann sei Du selbst. Sei ein Teil von INFOMOTION."
        ],
        "lists": {
            "company": [
                [
                    "INFOMOTION GmbH",
                    "Frankfurt, Köln, Stuttgart, München, Hamburg, Berlin, Dresden",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Du bist erfahren im Data Engineering für die Google Cloud Plattform (GCP)? Google und die Google Cloud-Umgebung sind Dir bestens bekannt, vor allem BigQuery, DataFlow, DataPlex, API und Looker? Dann wird es Zeit für INFOMOTION!",
                    "Konkret bringst Du vor allem Deine (Best-Practice-)Kenntnisse im Aufbau, in der Evaluierung, Planung und Umsetzung moderner Google Cloud-Plattform-Architekturen zur Anwendung. Auch dein Know-how in Infrastrukturthemen (Networking, IaC, Terraform etc.) wird gefragt sein.",
                    "Dazu tauchst Du tief in die Geschäftsprozesse unserer Kunden ein, entwickelst im Austausch mit dem Kunden maßgeschneiderte Lösungen und koordinierst das gesamte Projekt bis zur Implementierung und zum Betrieb – einschließlich Konfiguration und Anpassung an individuelle Prozesse und Anforderungen.",
                    "Dabei erstellst Du Demos, Use Cases und Projektplanungen, um die Kunden mit Deinem technischen Verständnis zu überzeugen und zu begeistern.",
                    "Klar, dass Du Dich in Deiner Senior-Funktion in den Sales-Prozess einbindest, neue Consultants schulst und coachst, Praktikanten und Abschlussarbeiten betreust und Präsenz auf Kongressen und Messen zeigst. Auch nutzt Du die Freiheiten zur eigenen Fortbildung."
                ],
                [
                    "Abgeschlossenes Bachelor- oder Masterstudium in (Wirtschafts-)Informatik, Mathematik, Physik, Datenmanagement oder einer ähnlichen Fachrichtung",
                    "Einige (2+) Jahre (Teil-)Projektleitungserfahrung im Bereich Google Cloud-Plattform (GCP) und deren Services mit Schwerpunkt Data Engineering/Data Management und Architektur",
                    "Sehr gute Einblicke in Infrastrukturthemen (Networking, IaC, Terraform etc.)",
                    "Fundierte Praxis im Umgang mit Kubernetes und Apache Airflow",
                    "Kommunikationssicherheit in sehr gutem Deutsch und sehr gutem Englisch für den Dialog mit internationalen Kunden.",
                    "Und persönlich? Begeisterst Du als kreativer, innovativer und lösungsorientierter Teamplayer, der für Kunden gerne tief in komplexe Themen eintaucht, diese analysiert, interpretiert und kommuniziert."
                ],
                [
                    "Hochflexible (hybride) Arbeitszeit-/ortsmodelle, 30 Tage Urlaub und (Integrated) Sabbatical-Möglichkeiten sorgen für eine ausgewogene Work-Life-Balance.",
                    "Transparente Vergütung und Karrierechancen",
                    "Erlebe einen respektvollen und fairen Umgang miteinander, der das Wohlbefinden und die Zufriedenheit unserer Mitarbeiterinnen und Mitarbeiter fördert.",
                    "Nutze unser exzellentes Wissensmanagement, unsere Academy Trainings oder lerne on the Job, um Deine Fähigkeiten kontinuierlich auszubauen und Dein Wissen mit anderen zu teilen.",
                    "Verwende unsere Grow your Talent Platform, um Deine berufliche sowie persönliche Entwicklung auf das nächste Level zu heben, um Deine Talente bei uns zu entfalten.",
                    "Entdecke Angeboten für Dein physisches und mentales Wohlbefinden. Lerne die INFOMOTION Kultur kennen, die Geselligkeit, Humor und Toleranz vereint."
                ]
            ],
            "unnamed_list": [
                [
                    "Data Engineer jobs",
                    "Datenbanken jobs",
                    "Bauwesen jobs",
                    "Data Analyst jobs",
                    "Marketing jobs",
                    "Product Owner jobs",
                    "Werkstudent jobs",
                    "E Commerce Manager jobs",
                    "Digital Marketing Manager jobs",
                    "Personalentwicklung jobs",
                    "Controller jobs"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Data-Integration-Engineer-m-w-d-Hamburg-SupplyX-c-o-Otto-Group-Logistics-GmbH--11836395-inline.html?rltr=47_22_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [],
        "lists": {
            "company": [
                [
                    "SupplyX c/o Otto Group Logistics GmbH",
                    "Hamburg",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit"
                ]
            ],
            "content/benefits": [
                [],
                [
                    "Abgeschlossenes Studium in Informatik, Datenmanagement oder eine vergleichbare Qualifi-kation.",
                    "Berufserfahrung im Bereich der Datenintegration, idealerweise in einem internationalen und logistischen Kontext.",
                    "Sehr gute Kenntnisse in der Nutzung und Implementierung von Lösungen mit dem Lobs-ter_Data (o.ä. tiefgreifende Kenntnisse in vergleichbaren Low-Code-Tools)",
                    "Kenntnisse in der Nutzung und Implementierung von Datenbanklösungen (SQL, NoSQL) in der Google Cloud Platform (GCP).",
                    "Gute Kenntnisse in den gängigen EDI-Standards (Edifact, XML etc.) und moderner techni-scher Anbindungen (API, Exchange Room etc.)",
                    "Analytische Denkweise sowie eine lösungsorientierte und teamfähige Persönlichkeit.",
                    "Kenntnisse in der Datenmodellierung und Datenqualitätsmanagement sind von Vorteil.",
                    "Du bringst sehr gute Deutschkenntnisse in Wort und Schrift mit."
                ],
                [
                    "Einsatz führender Technologien und agiler Prozesse",
                    "Du arbeitest für einen Arbeitgeber, dessen Unternehmenskultur geprägt ist durch ein offenes, kollaboratives und vertrauensvolles Miteinander",
                    "Flexible Arbeitszeiten, mobiles Arbeiten und Option auf Workation",
                    "Umfangreiches Weiterbildungsangebot",
                    "Personalrabatte auf das gesamte Sortiment der Otto-Group",
                    "Bezuschussung der HVV-ProfiCard, Fahrradleasing mit Lease a Bike, Altersvorsorge uvm.",
                    "Vergünstige und vielfältige Speiseauswahl in unserer modernen Kantine (Nur für HH gültig)"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Consultant-Cloud-Data-Engineer-m-w-d-bundesweit-Berlin-Frankfurt-Hamburg-Koeln-Leipzig-Muenchen-Sopra-Steria--11731299-inline.html?rltr=48_23_25_seorl_m_1_0_0_0_1_0",
        "paragraphs": [
            "Wir sind eine der führenden Management- und Technologieberatungen und verstehen uns als Vordenker*innen. Wir handeln und denken strategisch, sind überzeugend und unterstützen unsere Kunden mit maßgeschneiderten Lösungen, präzisen Prozessen und innovativen Technologien. Weltweit sind wir 52.000 kreative und kluge Köpfe, in Deutschland und Österreich rund 2.700. Gemeinsam gestalten wir mit digitalen Technologien die Zukunft unserer Kunden und die der Gesellschaft.",
            "Vielfalt ist eine wichtige Grundlage unserer Unternehmenskultur. Wir möchten ein inklusives Umfeld schaffen, das die Diversität all unserer Mitarbeitenden berücksichtigt und in dem du dich bestmöglich entfalten kannst. Denn wir bei Sopra Steria sind davon überzeugt, dass deine Individualität der Schlüssel zu einem nachhaltigen Unternehmenserfolg ist.",
            "Bist du bereit das digitale Europa zu gestalten?",
            "Impressum"
        ],
        "lists": {
            "company": [
                [
                    "Sopra Steria",
                    "bundesweit, Berlin, Frankfurt, Hamburg, Köln, Leipzig, München",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [
                    "Deine Aufgabe ist die Entwicklung neuer Features / Apps für unsere Kunden",
                    "Du analysierst Daten, konzeptionierst Datenströme und entwickelst Lösungen, die aus Daten einen echten Mehrwert schaffen",
                    "Du optimierst Datenflüsse und sorgst für eine hohe Datenqualität und -konsistenz",
                    "Dabei trägst du erste Verantwortung über alle Phasen des Projekts − von der Anforderungsanalyse über die Umsetzung bis hin zur Produktionsüberwachung",
                    "Schwerpunkt deiner täglichen Arbeit ist die Integration von Big Data (ETL/ELT, Streaming, Realtime, Pipelines, Workflows) on-premise oder in der Cloud sowie die Datenmodellierung (Data Warehouse, Datenbanken, Data Vault und Metadaten)",
                    "Darüber hinaus bringst du dich in unserer unternehmensweiten Analytics-Community ein"
                ],
                [
                    "Du verfügst über ein abgeschlossenes Studium der (Wirtschafts-) Informatik, -Mathematik, Wirtschaftswissenschaften oder eine vergleichbare Berufsausbildung",
                    "Du hast Interesse in dem Bereich Cloud Computing in Azure, AWS oder GCP",
                    "Erste Erfahrungen mit Datenbank- und Speichertechnologien sind von Vorteil",
                    "Du hast bereits Kenntnisse in Python, Java oder SQL gesammelt",
                    "Du begeisterst dich für cloudbasierte Architekturen & Tools (z.B. BigQuery, DataFlow, Cloud Composer, Pub/Sub) und hast Lust dich weiterzuentwickeln",
                    "Ausgeprägte analytische und kommunikative Fähigkeiten sowie die Begeisterung erste Verantwortung zu übernehmen, zeichnen dich aus",
                    "Gute Deutschkenntnisse (ab B2 Niveau) sowie Englischkenntnisse runden dein Profil ab"
                ],
                []
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Data-Engineer-all-genders-Hamburg-Dresden-Berlin-ParshipMeet-Group--11687997-inline.html?rltr=49_24_25_seorl_m_0_0_0_0_0_0",
        "paragraphs": [
            "Was du idealerweise zusätzlich mitbringst",
            "Weitere Benefits und Einblicke in die ParshipMeet Group findest du über den Link im Kontaktfeld."
        ],
        "lists": {
            "company": [
                [
                    "ParshipMeet Group",
                    "Hamburg, Dresden, Berlin",
                    "Feste Anstellung",
                    "Teilzeit, Vollzeit"
                ]
            ],
            "content/benefits": [
                [],
                [],
                [
                    "Analyse und Auswertung großer Datenmengen zur Generierung wertvoller Geschäftseinblicke."
                ],
                [
                    "Flexible Arbeitskultur",
                    "Arbeiten in Teilzeit",
                    "Zentrale und moderne Büros",
                    "Mobilitätsangebote",
                    "Training & Development",
                    "Essen und Getränke",
                    "Gesundheitsangebote",
                    "Altersvorsorge",
                    "Shopping Rabatte",
                    "CSR-Initiativen",
                    "Legendäre Partys",
                    "Team Building Events"
                ]
            ]
        }
    },
    {
        "url": "https://www.stepstone.de/stellenangebote--Senior-Data-Engineer-HR-m-w-d-Koeln-REWE-Group--11443966-inline.html?rltr=50_50_25_seorl_m_1_0_0_0_1_0",
        "paragraphs": [
            "50933 Köln |",
            "Vollzeit, unbefristet |",
            "852418",
            "Du willst mit deinen Ideen und Entwicklungen richtig was bewegen? Außerdem hast du Spaß an Logik und tüftelst gerne an technischen Problemstellungen? Dann wirst du bei uns fündig!  Die Basis unserer Arbeit bildet ein SAP Business Warehouse (BW), in dem wir unsere HR-Daten aufbereitet für Analysen, Reports und Dashboards zur Verfügung stellen. Ergänzt wird unsere Infrastruktur durch starke Cloud-Systeme (Google Cloud Platform und SAP Datasphere). Zusammen mit dir möchten wir das Testing sowie weitere Prozesse im Bereich der SAP BW Datenbeladung automatisieren – und damit die Datenqualität entscheidend verbessern.",
            "Zuschüssen für Kantine und vergünstigtes Deutschlandticket sowie Vorteilen beim Fahrrad-Leasing.",
            "Weitere Informationen erhältst Du auf unserer Website unter",
            "www.rewe-group.com/karriere",
            ".",
            "Wir freuen uns auf deine Bewerbung mit Angabe deiner Verfügbarkeit und Gehaltsvorstellung. Bitte nutze unser Onlineformular, so erreicht deine Bewerbung direkt den richtigen Ansprechpartner in unserem Recruiting Center. Bewerbungsunterlagen in Papierform können wir leider nicht zurücksenden.",
            "Bewerber-Servicetelefon",
            "unter",
            "0221 149-7110",
            "zur Verfügung."
        ],
        "lists": {
            "company": [
                [
                    "REWE Group",
                    "Köln",
                    "Feste Anstellung",
                    "Homeoffice möglich, Vollzeit",
                    "Gehalt anzeigen"
                ]
            ],
            "content/benefits": [
                [],
                [
                    "Deine Persönlichkeit steht im Mittelpunkt! Mit deinem hervorragenden Zahlenverständnis, deinen ausgeprägten analytischen Fähigkeiten und deiner präzisen Herangehensweise kannst du komplexe Sachverhalte durchdringen und elegante Lösungen für herausfordernde Probleme entwickeln.",
                    "Die Basis deines Erfolgs ist ein abgeschlossenes Studium der (Wirtschafts-) Informatik, Wirtschaftswissenschaften, Mathematik, Physik oder eine vergleichbare Qualifikation.",
                    "Du bringst sehr gute Kenntnisse in SQL und Python mit.",
                    "Dein fundiertes Wissen über relationale Datenbanken und Cloud-Technologien. Weiterhin deine fortgeschrittenen Kenntnisse über gängige Architekturen und Prozesse bei der Datenverarbeitung (z.B. ETL / ELT).",
                    "Du lebst technische Innovation und bist bestrebt, über Technologien und Entwicklungen immer up to date zu sein.",
                    "Erfahrungen mit SAP-Produkten (u.a. SAP BW, SAP Datasphere) sind ein Vorteil.",
                    "Ein agiles Mindset und Freude am eigenverantwortlichen Arbeiten runden dein Profil ab."
                ],
                [
                    "Zuschüssen für Kantine und vergünstigtes Deutschlandticket sowie Vorteilen beim Fahrrad-Leasing."
                ]
            ]
        }
    }
]